[
  {
    "weekNumber": 1,
    "weekLabel": "Week 1 — January 5–9",
    "days": [
      {
        "id": "w1d1",
        "dayOfWeek": "Monday",
        "dateLabel": "January 5",
        "readings": "Gen 1–2; Ps 19; Mark 1",
        "summary": "God creates the heavens and the earth, crowns humans with His image, reveals His glory in creation, and Jesus begins His public ministry calling people to follow Him.",
        "keyVerseRef": "Psalm 19:1 (NKJV)",
        "keyVerseText": "The heavens declare the glory of God; and the firmament shows His handiwork."
      },
      {
        "id": "w1d2",
        "dayOfWeek": "Tuesday",
        "dateLabel": "January 6",
        "readings": "Gen 3–5; Mark 2",
        "summary": "Sin enters the world, but God promises a coming Deliverer; even as death spreads, God preserves a line of faith, and Jesus forgives, heals, and calls sinners to Himself.",
        "keyVerseRef": "Genesis 3:15 (NKJV)",
        "keyVerseText": "And I will put enmity between you and the woman, and between your seed and her Seed; He shall bruise your head, and you shall bruise His heel."
      },
      {
        "id": "w1d3",
        "dayOfWeek": "Wednesday",
        "dateLabel": "January 7",
        "readings": "Gen 6–8; Ps 104; Mark 3",
        "summary": "Human wickedness fills the earth, yet Noah finds grace; God judges through the flood and restores creation, showing His power and faithfulness, while Jesus confronts evil and calls a new family of faith.",
        "keyVerseRef": "Genesis 6:8 (NKJV)",
        "keyVerseText": "But Noah found grace in the eyes of the LORD."
      },
      {
        "id": "w1d4",
        "dayOfWeek": "Thursday",
        "dateLabel": "January 8",
        "readings": "Gen 9–11; Mark 4",
        "summary": "God makes covenant with Noah, promises never again to destroy the earth with a flood, and scatters proud humanity at Babel, while Jesus teaches in parables about the kingdom of God growing like seed.",
        "keyVerseRef": "Genesis 9:13 (NKJV)",
        "keyVerseText": "I set My rainbow in the cloud, and it shall be for the sign of the covenant between Me and the earth."
      },
      {
        "id": "w1d5",
        "dayOfWeek": "Friday",
        "dateLabel": "January 9",
        "readings": "Gen 12–15; Ps 148; Mark 5",
        "summary": "God calls Abram, makes covenant to bless all nations through his offspring, counts his faith as righteousness, and we see Jesus’ authority to free the bound, heal the sick, and raise the dead.",
        "keyVerseRef": "Genesis 12:2 (NKJV)",
        "keyVerseText": "I will make you a great nation; I will bless you and make your name great; and you shall be a blessing."
      }
    ]
  },
  {
    "weekNumber": 2,
    "weekLabel": "Week 2 — January 12–16",
    "days": [
      {
        "id": "w2d1",
        "dayOfWeek": "Monday",
        "dateLabel": "January 12",
        "readings": "Gen 16–18; Mark 6",
        "summary": "Abram and Sarai try to ‘help’ God’s promise through Hagar, yet the Lord remains faithful and reaffirms His covenant, while Jesus feeds the multitudes and walks on water, revealing God’s compassion and power.",
        "keyVerseRef": "Genesis 18:14 (NKJV)",
        "keyVerseText": "Is anything too hard for the LORD? At the appointed time I will return to you, according to the time of life, and Sarah shall have a son."
      },
      {
        "id": "w2d2",
        "dayOfWeek": "Tuesday",
        "dateLabel": "January 13",
        "readings": "Gen 19–20; Ps 1; Mark 7",
        "summary": "God judges the wickedness of Sodom yet rescues Lot, shows mercy even amid failure, and we are reminded that the blessed life delights in God’s law, while Jesus confronts empty traditions and cleanses hearts.",
        "keyVerseRef": "Psalm 1:2 (NKJV)",
        "keyVerseText": "But his delight is in the law of the LORD, and in His law he meditates day and night."
      },
      {
        "id": "w2d3",
        "dayOfWeek": "Wednesday",
        "dateLabel": "January 14",
        "readings": "Gen 21–23; Ps 107; Mark 8",
        "summary": "God keeps His promise as Isaac is born; Abraham’s faith is tested on the mountain, pointing to a greater sacrifice to come, while Jesus calls His followers to deny themselves and take up their cross.",
        "keyVerseRef": "Genesis 22:8 (NKJV)",
        "keyVerseText": "And Abraham said, “My son, God will provide for Himself the lamb for a burnt offering.” So the two of them went together."
      },
      {
        "id": "w2d4",
        "dayOfWeek": "Thursday",
        "dateLabel": "January 15",
        "readings": "Gen 24–25; Ps 4; Mark 9",
        "summary": "God providentially leads in Isaac’s marriage and the next generation, while rival nations are pictured in Jacob and Esau, and Jesus is transfigured in glory and teaches about true greatness and faith.",
        "keyVerseRef": "Genesis 24:27 (NKJV)",
        "keyVerseText": "Blessed be the LORD God of my master Abraham, who has not forsaken His mercy and His truth toward my master. As for me, being on the way, the LORD led me to the house of my master’s brethren."
      },
      {
        "id": "w2d5",
        "dayOfWeek": "Friday",
        "dateLabel": "January 16",
        "readings": "Gen 26–27; Mark 10",
        "summary": "God reaffirms His covenant to Isaac, protects him, and works even through family conflict and deceit, while Jesus teaches about humble, childlike faith and the cost of following Him above riches.",
        "keyVerseRef": "Genesis 26:24 (NKJV)",
        "keyVerseText": "And the LORD appeared to him the same night and said, “I am the God of your father Abraham; do not fear, for I am with you. I will bless you and multiply your descendants for My servant Abraham’s sake.”"
      }
    ]
  },
{
  "weekNumber": 3,
  "weekLabel": "Week 3 — January 19–23",
  "days": [
    {
      "id": "w3d1",
      "dayOfWeek": "Monday",
      "dateLabel": "January 19",
      "readings": "Gen 28–29; Mark 11",
      "summary": "Jacob encounters God at Bethel and begins his years of service with Laban, while Jesus enters Jerusalem as the promised Messiah and teaches about true faith and fruitfulness.",
      "keyVerseRef": "Genesis 28:15 (NKJV)",
      "keyVerseText": "Behold, I am with you and will keep you wherever you go, and will bring you back to this land; for I will not leave you until I have done what I have spoken to you."
    },
    {
      "id": "w3d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "January 20",
      "readings": "Gen 30–31; Ps 11; Mark 12",
      "summary": "God prospers Jacob despite tension and deceit, showing His covenant faithfulness, while Jesus teaches the greatest commandments—love God with all your heart, and love your neighbor as yourself.",
      "keyVerseRef": "Mark 12:30–31 (NKJV)",
      "keyVerseText": "‘And you shall love the LORD your God with all your heart, with all your soul, with all your mind, and with all your strength.’ This is the first commandment. And the second, like it, is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these."
    },
    {
      "id": "w3d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "January 21",
      "readings": "Gen 32–34; Ps 145; Mark 13",
      "summary": "Jacob wrestles with God and receives a new name—Israel. Reconciliation with Esau displays grace triumphing over fear, and Jesus speaks of the end times, calling His people to watch and endure.",
      "keyVerseRef": "Genesis 32:28 (NKJV)",
      "keyVerseText": "And He said, “Your name shall no longer be called Jacob, but Israel; for you have struggled with God and with men, and have prevailed.”"
    },
    {
      "id": "w3d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "January 22",
      "readings": "Gen 35–37; Ps 12; Mark 14",
      "summary": "God reaffirms His covenant with Jacob; Joseph is betrayed by his brothers yet remains central to God’s plan, while Jesus prepares for the cross—the ultimate betrayal that will bring salvation.",
      "keyVerseRef": "Genesis 35:11 (NKJV)",
      "keyVerseText": "Also God said to him: “I am God Almighty. Be fruitful and multiply; a nation and a company of nations shall proceed from you, and kings shall come from your body.”"
    },
    {
      "id": "w3d5",
      "dayOfWeek": "Friday",
      "dateLabel": "January 23",
      "readings": "Gen 38–40; Mark 15",
      "summary": "God works through broken people as Judah’s line moves toward Messiah, and Joseph rises through suffering to a place of influence—pointing to Christ, the innocent One condemned yet victorious.",
      "keyVerseRef": "Mark 15:39 (NKJV)",
      "keyVerseText": "So when the centurion, who stood opposite Him, saw that He cried out like this and breathed His last, he said, “Truly this Man was the Son of God!”"
    }
  ]
},
{
  "weekNumber": 4,
  "weekLabel": "Week 4 — January 26–30",
  "days": [
    {
      "id": "w4d1",
      "dayOfWeek": "Monday",
      "dateLabel": "January 26",
      "readings": "Gen 41–42; Mark 16",
      "summary": "Joseph interprets Pharaoh’s dreams and rises to power, saving many lives. His brothers come seeking grain, beginning a powerful story of grace and reconciliation. Christ is risen—our salvation and hope.",
      "keyVerseRef": "Mark 16:6 (NKJV)",
      "keyVerseText": "But he said to them, “Do not be alarmed. You seek Jesus of Nazareth, who was crucified. He is risen! He is not here.”"
    },
    {
      "id": "w4d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "January 27",
      "readings": "Gen 43–44; Ps 24; Gal 1",
      "summary": "Joseph tests his brothers and reveals the transformation of Judah, while Psalm 24 declares God’s glory and Paul defends the true gospel—Christ’s work alone saves.",
      "keyVerseRef": "Galatians 1:10 (NKJV)",
      "keyVerseText": "For do I now persuade men, or God? Or do I seek to please men? For if I still pleased men, I would not be a bondservant of Christ."
    },
    {
      "id": "w4d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "January 28",
      "readings": "Gen 45–46; Ps 108; Gal 2",
      "summary": "Joseph reveals himself and extends forgiveness, restoring what was broken for God’s glory. Israel moves to Egypt in faith. Paul confronts hypocrisy, affirming justification by faith alone.",
      "keyVerseRef": "Genesis 45:5 (NKJV)",
      "keyVerseText": "But now, do not therefore be grieved or angry with yourselves because you sold me here; for God sent me before you to preserve life."
    },
    {
      "id": "w4d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "January 29",
      "readings": "Gen 47–48; Ps 25; Gal 3",
      "summary": "Israel blesses Joseph’s sons by faith, giving Ephraim greater honor. God’s covenant promise continues through generations. Paul teaches that righteousness comes through faith—not law.",
      "keyVerseRef": "Galatians 3:29 (NKJV)",
      "keyVerseText": "And if you are Christ’s, then you are Abraham’s seed, and heirs according to the promise."
    },
    {
      "id": "w4d5",
      "dayOfWeek": "Friday",
      "dateLabel": "January 30",
      "readings": "Gen 49–50; Gal 4",
      "summary": "Jacob blesses his sons, prophesying kingship through Judah and pointing to the Messiah. Joseph’s death points forward to deliverance yet to come. In Christ we are adopted as sons and heirs.",
      "keyVerseRef": "Galatians 4:7 (NKJV)",
      "keyVerseText": "Therefore you are no longer a slave but a son, and if a son, then an heir of God through Christ."
    }
  ]
},
{
  "weekNumber": 5,
  "weekLabel": "Week 5 — February 2–6",
  "days": [
    {
      "id": "w5d1",
      "dayOfWeek": "Monday",
      "dateLabel": "February 2",
      "readings": "Ex 1–3; Gal 5",
      "summary": "Israel suffers under bondage, but God remembers His covenant. Moses is called through the burning bush to deliver His people. In Galatians we are called to freedom through the Spirit, not works of the flesh.",
      "keyVerseRef": "Exodus 3:14 (NKJV)",
      "keyVerseText": "And God said to Moses, “I AM WHO I AM.” And He said, “Thus you shall say to the children of Israel, ‘I AM has sent me to you.’ ”"
    },
    {
      "id": "w5d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "February 3",
      "readings": "Ex 4–6; Gal 6",
      "summary": "Moses returns to Egypt in obedience, but Pharaoh resists. God reveals His name—Yahweh—as the One who keeps covenant. In Galatians we reap what we sow and bear one another’s burdens.",
      "keyVerseRef": "Galatians 6:9 (NKJV)",
      "keyVerseText": "And let us not grow weary while doing good, for in due season we shall reap if we do not lose heart."
    },
    {
      "id": "w5d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "February 4",
      "readings": "Ex 7–9; Ps 105; Eph 1",
      "summary": "God sends plagues demonstrating His power over Egypt. Psalm 105 recalls His faithful works, and Ephesians declares believers chosen in Christ from before the foundation of the world.",
      "keyVerseRef": "Ephesians 1:7 (NKJV)",
      "keyVerseText": "In Him we have redemption through His blood, the forgiveness of sins, according to the riches of His grace."
    },
    {
      "id": "w5d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "February 5",
      "readings": "Ex 10–12; Eph 2",
      "summary": "The Passover reveals salvation through the blood of the lamb—pointing to Christ. God delivers His people by mighty power. We are saved by grace through faith, not works.",
      "keyVerseRef": "Ephesians 2:8–9 (NKJV)",
      "keyVerseText": "For by grace you have been saved through faith, and that not of yourselves; it is the gift of God, not of works, lest anyone should boast."
    },
    {
      "id": "w5d5",
      "dayOfWeek": "Friday",
      "dateLabel": "February 6",
      "readings": "Ex 13–15; Ps 114; Eph 3",
      "summary": "Israel crosses the Red Sea and God defeats the enemy. Miriam sings praise. Psalm 114 remembers the great deliverance, while Ephesians reveals the mystery of salvation for all nations.",
      "keyVerseRef": "Exodus 14:14 (NKJV)",
      "keyVerseText": "The LORD will fight for you, and you shall hold your peace."
    }
  ]
},
{
  "weekNumber": 6,
  "weekLabel": "Week 6 — February 9–13",
  "days": [
    {
      "id": "w6d1",
      "dayOfWeek": "Monday",
      "dateLabel": "February 9",
      "readings": "Ex 16–18; Eph 4",
      "summary": "God provides manna in the wilderness and water from the rock, teaching His people dependence and obedience. In Ephesians we are called to unity, maturity, and love.",
      "keyVerseRef": "Exodus 16:4 (NKJV)",
      "keyVerseText": "Then the LORD said to Moses, “Behold, I will rain bread from heaven for you. And the people shall go out and gather a certain quota every day.”"
    },
    {
      "id": "w6d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "February 10",
      "readings": "Ex 19–21; Ps 33; Eph 5",
      "summary": "God gives the law at Sinai, declaring Israel His treasured possession. Psalm 33 celebrates His power and faithfulness, while Ephesians calls believers to walk in love and purity.",
      "keyVerseRef": "Exodus 19:5 (NKJV)",
      "keyVerseText": "Now therefore, if you will indeed obey My voice and keep My covenant, then you shall be a special treasure to Me above all people."
    },
    {
      "id": "w6d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "February 11",
      "readings": "Ex 22–24; Ps 109; Eph 6",
      "summary": "God establishes justice and covenant law, and the people pledge obedience. Psalm 109 cries for righteous judgment. In Ephesians we take up the armor of God for victory in spiritual warfare.",
      "keyVerseRef": "Ephesians 6:11 (NKJV)",
      "keyVerseText": "Put on the whole armor of God, that you may be able to stand against the wiles of the devil."
    },
    {
      "id": "w6d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "February 12",
      "readings": "Ex 25–27; Ps 90; Phil 1",
      "summary": "God gives instructions for the tabernacle—where He will dwell among His people. Psalm 90 contrasts human frailty with God’s eternal strength. Philippians rejoices even in hardship.",
      "keyVerseRef": "Philippians 1:6 (NKJV)",
      "keyVerseText": "Being confident of this very thing, that He who has begun a good work in you will complete it until the day of Jesus Christ."
    },
    {
      "id": "w6d5",
      "dayOfWeek": "Friday",
      "dateLabel": "February 13",
      "readings": "Ex 28–31; Phil 2",
      "summary": "God sets apart priests for holy service and establishes Sabbath rest. Christ is our High Priest and humble Servant. Philippians calls believers to have the mind of Christ.",
      "keyVerseRef": "Philippians 2:5 (NKJV)",
      "keyVerseText": "Let this mind be in you which was also in Christ Jesus."
    }
  ]
},
{
  "weekNumber": 7,
  "weekLabel": "Week 7 — February 16–20",
  "days": [
    {
      "id": "w7d1",
      "dayOfWeek": "Monday",
      "dateLabel": "February 16",
      "readings": "Ex 32–34; Phil 3",
      "summary": "Israel falls into idolatry with the golden calf, yet Moses intercedes and God renews His covenant. Paul presses on to know Christ above all else, counting everything else as loss.",
      "keyVerseRef": "Exodus 33:14 (NKJV)",
      "keyVerseText": "And He said, “My Presence will go with you, and I will give you rest.”"
    },
    {
      "id": "w7d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "February 17",
      "readings": "Ex 35–37; Ps 26; Phil 4",
      "summary": "The people generously give for the tabernacle and gifted artisans build what God designed. David prays for integrity, and Paul calls believers to rejoice, pray, and rest in God’s peace.",
      "keyVerseRef": "Philippians 4:6–7 (NKJV)",
      "keyVerseText": "Be anxious for nothing, but in everything by prayer and supplication, with thanksgiving, let your requests be made known to God; and the peace of God, which surpasses all understanding, will guard your hearts and minds through Christ Jesus."
    },
    {
      "id": "w7d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "February 18",
      "readings": "Ex 38–40; Heb 1",
      "summary": "The tabernacle is completed and God’s glory fills it, dwelling in the midst of His people. Hebrews proclaims Jesus as the exact representation of God’s nature and the One who purged our sins.",
      "keyVerseRef": "Hebrews 1:3 (NKJV)",
      "keyVerseText": "Who being the brightness of His glory and the express image of His person, and upholding all things by the word of His power, when He had by Himself purged our sins, sat down at the right hand of the Majesty on high."
    },
    {
      "id": "w7d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "February 19",
      "readings": "Lev 1–3; Ps 27; Heb 2",
      "summary": "God establishes offerings that point to atonement and fellowship with Him. David declares the Lord as his light and salvation. Hebrews warns us not to neglect such a great salvation in Christ.",
      "keyVerseRef": "Hebrews 2:3 (NKJV)",
      "keyVerseText": "How shall we escape if we neglect so great a salvation, which at the first began to be spoken by the Lord, and was confirmed to us by those who heard Him."
    },
    {
      "id": "w7d5",
      "dayOfWeek": "Friday",
      "dateLabel": "February 20",
      "readings": "Lev 4–7; Heb 3",
      "summary": "Sin and guilt offerings show the seriousness of sin and God’s provision for forgiveness. Hebrews urges us to hold fast our confidence in Christ and not harden our hearts as Israel did.",
      "keyVerseRef": "Hebrews 3:1 (NKJV)",
      "keyVerseText": "Therefore, holy brethren, partakers of the heavenly calling, consider the Apostle and High Priest of our confession, Christ Jesus."
    }
  ]
},
{
  "weekNumber": 8,
  "weekLabel": "Week 8 — February 23–27",
  "days": [
    {
      "id": "w8d1",
      "dayOfWeek": "Monday",
      "dateLabel": "February 23",
      "readings": "Lev 8–11; Ps 110; Heb 4",
      "summary": "Priests are consecrated for holy service, and God distinguishes between clean and unclean. Psalm 110 points to a priest-king Messiah. Hebrews calls us to enter God’s rest and draw near with confidence.",
      "keyVerseRef": "Hebrews 4:16 (NKJV)",
      "keyVerseText": "Let us therefore come boldly to the throne of grace, that we may obtain mercy and find grace to help in time of need."
    },
    {
      "id": "w8d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "February 24",
      "readings": "Lev 12–14; Ps 111; Heb 5",
      "summary": "Laws about uncleanness and leprosy highlight God’s concern for holiness and community life. Psalm 111 praises His works. Hebrews presents Jesus as the compassionate High Priest who learned obedience.",
      "keyVerseRef": "Hebrews 5:9 (NKJV)",
      "keyVerseText": "And having been perfected, He became the author of eternal salvation to all who obey Him."
    },
    {
      "id": "w8d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "February 25",
      "readings": "Lev 15–18; Ps 31; Heb 6",
      "summary": "God gives laws for purity, blood, and sexual holiness, calling His people to be distinct. Psalm 31 trusts in God amid trouble. Hebrews urges maturity and anchors our hope in God’s unchanging promise.",
      "keyVerseRef": "Hebrews 6:19 (NKJV)",
      "keyVerseText": "This hope we have as an anchor of the soul, both sure and steadfast, and which enters the Presence behind the veil."
    },
    {
      "id": "w8d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "February 26",
      "readings": "Lev 19–20; Heb 7",
      "summary": "God calls His people to practical holiness in relationships, justice, and worship. Hebrews shows Jesus as our eternal High Priest who lives to make intercession for us.",
      "keyVerseRef": "Hebrews 7:25 (NKJV)",
      "keyVerseText": "Therefore He is also able to save to the uttermost those who come to God through Him, since He always lives to make intercession for them."
    },
    {
      "id": "w8d5",
      "dayOfWeek": "Friday",
      "dateLabel": "February 27",
      "readings": "Lev 21–23; Heb 8",
      "summary": "Priests are called to holiness and the appointed feasts are outlined, all pointing to God’s redemptive plan. Hebrews proclaims Jesus as mediator of a better covenant with better promises.",
      "keyVerseRef": "Hebrews 8:6 (NKJV)",
      "keyVerseText": "But now He has obtained a more excellent ministry, inasmuch as He is also Mediator of a better covenant, which was established on better promises."
    }
  ]
},
{
  "weekNumber": 9,
  "weekLabel": "Week 9 — March 2–6",
  "days": [
    {
      "id": "w9d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 2",
      "readings": "Lev 24–25; Ps 81; Heb 9",
      "summary": "God calls His people to holiness, justice, and Sabbath rest, including the Year of Jubilee that restores what was lost. Psalm 81 urges God’s people to listen and trust Him. Hebrews 9 shows Jesus as our great High Priest whose once-for-all sacrifice brings eternal redemption.",
      "keyVerseRef": "Hebrews 9:12 (NKJV)",
      "keyVerseText": "Not with the blood of goats and calves, but with His own blood He entered the Most Holy Place once for all, having obtained eternal redemption."
    },
    {
      "id": "w9d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 3",
      "readings": "Lev 26–27; Ps 112; Heb 10",
      "summary": "God sets before Israel blessings for obedience and curses for rebellion, yet remembers His covenant. Psalm 112 praises the righteous who fear the LORD. Hebrews 10 points to Christ’s perfect sacrifice and urges us to hold fast our hope.",
      "keyVerseRef": "Hebrews 10:23 (NKJV)",
      "keyVerseText": "Let us hold fast the confession of our hope without wavering, for He who promised is faithful."
    },
    {
      "id": "w9d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "March 4",
      "readings": "Num 1–2; Ps 64; Heb 11",
      "summary": "Israel is counted and arranged around the tabernacle, with God at the center of their camp. Psalm 64 appeals to God for protection from the wicked. Hebrews 11 celebrates men and women of faith who trusted God’s promises even when they could not see the outcome.",
      "keyVerseRef": "Hebrews 11:1 (NKJV)",
      "keyVerseText": "Now faith is the substance of things hoped for, the evidence of things not seen."
    },
    {
      "id": "w9d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "March 5",
      "readings": "Num 3–5; Heb 12",
      "summary": "The Levites are set apart to serve and guard the tabernacle, and the camp is kept pure. Hebrews 12 calls us to run with endurance, fixing our eyes on Jesus and receiving the Father’s loving discipline.",
      "keyVerseRef": "Hebrews 12:1–2 (NKJV)",
      "keyVerseText": "Therefore we also, since we are surrounded by so great a cloud of witnesses, let us lay aside every weight, and the sin which so easily ensnares us, and let us run with endurance the race that is set before us, looking unto Jesus, the author and finisher of our faith."
    },
    {
      "id": "w9d5",
      "dayOfWeek": "Friday",
      "dateLabel": "March 6",
      "readings": "Num 6–7; Heb 13",
      "summary": "The Nazirite vow and priestly blessing highlight a life set apart to God and His desire to put His name on His people. Offerings are brought for the altar’s dedication. Hebrews 13 calls believers to worshipful lives, trusting Jesus who never changes.",
      "keyVerseRef": "Hebrews 13:20–21 (NKJV)",
      "keyVerseText": "Now may the God of peace who brought up our Lord Jesus from the dead, that great Shepherd of the sheep, through the blood of the everlasting covenant, make you complete in every good work to do His will, working in you what is well pleasing in His sight, through Jesus Christ, to whom be glory forever and ever. Amen."
    }
  ]
},
{
  "weekNumber": 10,
  "weekLabel": "Week 10 — March 9–13",
  "days": [
    {
      "id": "w10d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 9",
      "readings": "Num 8–11; Col 1",
      "summary": "The Levites are cleansed for service, Israel keeps the Passover, and God guides His people by cloud and fire. Complaints in the wilderness reveal unbelief, yet God still provides. Colossians 1 exalts Christ as supreme over creation and the head of the church.",
      "keyVerseRef": "Colossians 1:13–14 (NKJV)",
      "keyVerseText": "He has delivered us from the power of darkness and conveyed us into the kingdom of the Son of His love, in whom we have redemption through His blood, the forgiveness of sins."
    },
    {
      "id": "w10d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 10",
      "readings": "Num 12–14; Ps 28; Col 2",
      "summary": "Miriam and Aaron oppose Moses and are corrected by God. The spies’ bad report leads Israel to rebel at the edge of the promised land. Psalm 28 cries out for mercy and strength. Colossians 2 proclaims the fullness of Christ and warns against deceptive substitutes.",
      "keyVerseRef": "Colossians 2:9–10 (NKJV)",
      "keyVerseText": "For in Him dwells all the fullness of the Godhead bodily; and you are complete in Him, who is the head of all principality and power."
    },
    {
      "id": "w10d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "March 11",
      "readings": "Num 15–18; Ps 113; Col 3",
      "summary": "God reinforces His commands, judges rebellion in Korah’s uprising, and confirms Aaron’s priesthood. Psalm 113 praises the LORD who lifts the lowly. Colossians 3 calls believers to seek things above and live out the new life in Christ.",
      "keyVerseRef": "Colossians 3:1–2 (NKJV)",
      "keyVerseText": "If then you were raised with Christ, seek those things which are above, where Christ is, sitting at the right hand of God. Set your mind on things above, not on things on the earth."
    },
    {
      "id": "w10d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "March 12",
      "readings": "Num 19–21; Col 4",
      "summary": "The red heifer offering provides cleansing from death’s defilement. Moses fails to honor God at Meribah, and Israel looks to the bronze serpent for healing. God grants victories on the way. Colossians 4 exhorts believers to steadfast prayer and wise witness.",
      "keyVerseRef": "Colossians 4:2 (NKJV)",
      "keyVerseText": "Continue earnestly in prayer, being vigilant in it with thanksgiving."
    },
    {
      "id": "w10d5",
      "dayOfWeek": "Friday",
      "dateLabel": "March 13",
      "readings": "Num 22–25; Luke 1",
      "summary": "Balak hires Balaam to curse Israel, but God turns the curse into blessing. Yet Israel falls into sin with Moab. Luke 1 shows God unfolding His plan of salvation through the births of John the Baptist and Jesus, the promised King.",
      "keyVerseRef": "Luke 1:32–33 (NKJV)",
      "keyVerseText": "He will be great, and will be called the Son of the Highest; and the Lord God will give Him the throne of His father David. And He will reign over the house of Jacob forever, and of His kingdom there will be no end."
    }
  ]
},
{
  "weekNumber": 11,
  "weekLabel": "Week 11 — March 16–20",
  "days": [
    {
      "id": "w11d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 16",
      "readings": "Num 26–29; Luke 2",
      "summary": "Israel is numbered again and offerings are appointed as the people prepare for the promised land. In Luke 2, Jesus is born, presented in the temple, and recognized as God’s salvation for all peoples.",
      "keyVerseRef": "Luke 2:11 (NKJV)",
      "keyVerseText": "For there is born to you this day in the city of David a Savior, who is Christ the Lord."
    },
    {
      "id": "w11d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 17",
      "readings": "Num 30–33; Ps 35; Luke 3",
      "summary": "God gives instructions about vows and recounts Israel’s journey from Egypt to the edge of Canaan. Psalm 35 cries out for justice. In Luke 3, John prepares the way and Jesus is baptized, affirmed by the Father and the Spirit.",
      "keyVerseRef": "Luke 3:22 (NKJV)",
      "keyVerseText": "And the Holy Spirit descended in bodily form like a dove upon Him, and a voice came from heaven which said, “You are My beloved Son; in You I am well pleased.”"
    },
    {
      "id": "w11d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "March 18",
      "readings": "Num 34–36; Luke 4",
      "summary": "The boundaries of the land and cities of refuge are appointed, showing God’s concern for justice and inheritance. In Luke 4, Jesus overcomes temptation and begins His ministry, proclaiming good news and freedom.",
      "keyVerseRef": "Luke 4:18 (NKJV)",
      "keyVerseText": "“The Spirit of the LORD is upon Me, because He has anointed Me to preach the gospel to the poor; He has sent Me to heal the brokenhearted, to proclaim liberty to the captives and recovery of sight to the blind, to set at liberty those who are oppressed.”"
    },
    {
      "id": "w11d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "March 19",
      "readings": "Deut 1–3; Ps 36; Luke 5",
      "summary": "Moses reviews Israel’s history of failure and God’s faithfulness as they stand ready to enter the land. Psalm 36 contrasts human wickedness with God’s steadfast love. In Luke 5, Jesus calls disciples, heals, and forgives sins.",
      "keyVerseRef": "Luke 5:10 (NKJV)",
      "keyVerseText": "And Jesus said to Simon, “Do not be afraid. From now on you will catch men.”"
    },
    {
      "id": "w11d5",
      "dayOfWeek": "Friday",
      "dateLabel": "March 20",
      "readings": "Deut 4–5; Luke 6",
      "summary": "God calls Israel to remember His mighty acts, obey His commands, and teach their children diligently. The Ten Commandments are reviewed. In Luke 6, Jesus teaches about true discipleship and a life built on His words.",
      "keyVerseRef": "Luke 6:46 (NKJV)",
      "keyVerseText": "“But why do you call Me ‘Lord, Lord,’ and not do the things which I say?”"
    }
  ]
},
{
  "weekNumber": 12,
  "weekLabel": "Week 12 — March 23–27",
  "days": [
    {
      "id": "w12d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 23",
      "readings": "Deut 6–9; Luke 7",
      "summary": "Moses commands Israel to love the LORD wholeheartedly, remember His Word, and not forget Him in prosperity. In Luke 7, Jesus heals, raises the dead, and forgives a sinful woman who loves much.",
      "keyVerseRef": "Deuteronomy 6:5 (NKJV)",
      "keyVerseText": "You shall love the LORD your God with all your heart, with all your soul, and with all your strength."
    },
    {
      "id": "w12d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 24",
      "readings": "Deut 10–14; Ps 5; Luke 8",
      "summary": "God calls Israel to fear Him, walk in His ways, and care for the vulnerable, living as a holy people. Psalm 5 cries out for guidance. In Luke 8, Jesus calms storms, casts out demons, and responds to personal faith.",
      "keyVerseRef": "Deuteronomy 10:12 (NKJV)",
      "keyVerseText": "And now, Israel, what does the LORD your God require of you, but to fear the LORD your God, to walk in all His ways and to love Him, to serve the LORD your God with all your heart and with all your soul."
    },
    {
      "id": "w12d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "March 25",
      "readings": "Deut 15–18; Ps 115; Luke 9",
      "summary": "God instructs His people about generosity, release, and leadership, promising a coming Prophet like Moses. Psalm 115 contrasts lifeless idols with the living God. In Luke 9, Jesus calls His followers to deny themselves and take up their cross daily.",
      "keyVerseRef": "Luke 9:23 (NKJV)",
      "keyVerseText": "Then He said to them all, “If anyone desires to come after Me, let him deny himself, and take up his cross daily, and follow Me.”"
    },
    {
      "id": "w12d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "March 26",
      "readings": "Deut 19–22; Ps 6; Luke 10",
      "summary": "God provides laws for justice, protection of the innocent, and care in relationships. Psalm 6 is a cry for mercy in distress. In Luke 10, Jesus sends out the seventy and teaches the parable of the Good Samaritan, calling us to love our neighbor.",
      "keyVerseRef": "Luke 10:27 (NKJV)",
      "keyVerseText": "So he answered and said, “ ‘You shall love the LORD your God with all your heart, with all your soul, with all your strength, and with all your mind,’ and ‘your neighbor as yourself.’ ”"
    },
    {
      "id": "w12d5",
      "dayOfWeek": "Friday",
      "dateLabel": "March 27",
      "readings": "Deut 23–26; Luke 11",
      "summary": "God gives instructions for holiness in community, worship, and offerings, including the confession of His saving work. In Luke 11, Jesus teaches on prayer and warns against hypocrisy and unbelief.",
      "keyVerseRef": "Luke 11:9 (NKJV)",
      "keyVerseText": "“So I say to you, ask, and it will be given to you; seek, and you will find; knock, and it will be opened to you.”"
    }
  ]
}
]

