[
  {
    "weekNumber": 1,
    "weekLabel": "Week 1 — January 5–9",
    "days": [
      {
        "id": "w1d1",
        "dayOfWeek": "Monday",
        "dateLabel": "January 5",
        "readings": "Gen 1–2; Ps 19; Mark 1",
        "summary": "God creates the heavens and the earth, crowns humans with His image, reveals His glory in creation, and Jesus begins His public ministry calling people to follow Him.",
        "keyVerseRef": "Psalm 19:1 (NKJV)",
        "keyVerseText": "The heavens declare the glory of God; and the firmament shows His handiwork."
      },
      {
        "id": "w1d2",
        "dayOfWeek": "Tuesday",
        "dateLabel": "January 6",
        "readings": "Gen 3–5; Mark 2",
        "summary": "Sin enters the world, but God promises a coming Deliverer; even as death spreads, God preserves a line of faith, and Jesus forgives, heals, and calls sinners to Himself.",
        "keyVerseRef": "Genesis 3:15 (NKJV)",
        "keyVerseText": "And I will put enmity between you and the woman, and between your seed and her Seed; He shall bruise your head, and you shall bruise His heel."
      },
      {
        "id": "w1d3",
        "dayOfWeek": "Wednesday",
        "dateLabel": "January 7",
        "readings": "Gen 6–8; Ps 104; Mark 3",
        "summary": "Human wickedness fills the earth, yet Noah finds grace; God judges through the flood and restores creation, showing His power and faithfulness, while Jesus confronts evil and calls a new family of faith.",
        "keyVerseRef": "Genesis 6:8 (NKJV)",
        "keyVerseText": "But Noah found grace in the eyes of the LORD."
      },
      {
        "id": "w1d4",
        "dayOfWeek": "Thursday",
        "dateLabel": "January 8",
        "readings": "Gen 9–11; Mark 4",
        "summary": "God makes covenant with Noah, promises never again to destroy the earth with a flood, and scatters proud humanity at Babel, while Jesus teaches in parables about the kingdom of God growing like seed.",
        "keyVerseRef": "Genesis 9:13 (NKJV)",
        "keyVerseText": "I set My rainbow in the cloud, and it shall be for the sign of the covenant between Me and the earth."
      },
      {
        "id": "w1d5",
        "dayOfWeek": "Friday",
        "dateLabel": "January 9",
        "readings": "Gen 12–15; Ps 148; Mark 5",
        "summary": "God calls Abram, makes covenant to bless all nations through his offspring, counts his faith as righteousness, and we see Jesus’ authority to free the bound, heal the sick, and raise the dead.",
        "keyVerseRef": "Genesis 12:2 (NKJV)",
        "keyVerseText": "I will make you a great nation; I will bless you and make your name great; and you shall be a blessing."
      }
    ]
  },
  {
    "weekNumber": 2,
    "weekLabel": "Week 2 — January 12–16",
    "days": [
      {
        "id": "w2d1",
        "dayOfWeek": "Monday",
        "dateLabel": "January 12",
        "readings": "Gen 16–18; Mark 6",
        "summary": "Abram and Sarai try to ‘help’ God’s promise through Hagar, yet the Lord remains faithful and reaffirms His covenant, while Jesus feeds the multitudes and walks on water, revealing God’s compassion and power.",
        "keyVerseRef": "Genesis 18:14 (NKJV)",
        "keyVerseText": "Is anything too hard for the LORD? At the appointed time I will return to you, according to the time of life, and Sarah shall have a son."
      },
      {
        "id": "w2d2",
        "dayOfWeek": "Tuesday",
        "dateLabel": "January 13",
        "readings": "Gen 19–20; Ps 1; Mark 7",
        "summary": "God judges the wickedness of Sodom yet rescues Lot, shows mercy even amid failure, and we are reminded that the blessed life delights in God’s law, while Jesus confronts empty traditions and cleanses hearts.",
        "keyVerseRef": "Psalm 1:2 (NKJV)",
        "keyVerseText": "But his delight is in the law of the LORD, and in His law he meditates day and night."
      },
      {
        "id": "w2d3",
        "dayOfWeek": "Wednesday",
        "dateLabel": "January 14",
        "readings": "Gen 21–23; Ps 107; Mark 8",
        "summary": "God keeps His promise as Isaac is born; Abraham’s faith is tested on the mountain, pointing to a greater sacrifice to come, while Jesus calls His followers to deny themselves and take up their cross.",
        "keyVerseRef": "Genesis 22:8 (NKJV)",
        "keyVerseText": "And Abraham said, “My son, God will provide for Himself the lamb for a burnt offering.” So the two of them went together."
      },
      {
        "id": "w2d4",
        "dayOfWeek": "Thursday",
        "dateLabel": "January 15",
        "readings": "Gen 24–25; Ps 4; Mark 9",
        "summary": "God providentially leads in Isaac’s marriage and the next generation, while rival nations are pictured in Jacob and Esau, and Jesus is transfigured in glory and teaches about true greatness and faith.",
        "keyVerseRef": "Genesis 24:27 (NKJV)",
        "keyVerseText": "Blessed be the LORD God of my master Abraham, who has not forsaken His mercy and His truth toward my master. As for me, being on the way, the LORD led me to the house of my master’s brethren."
      },
      {
        "id": "w2d5",
        "dayOfWeek": "Friday",
        "dateLabel": "January 16",
        "readings": "Gen 26–27; Mark 10",
        "summary": "God reaffirms His covenant to Isaac, protects him, and works even through family conflict and deceit, while Jesus teaches about humble, childlike faith and the cost of following Him above riches.",
        "keyVerseRef": "Genesis 26:24 (NKJV)",
        "keyVerseText": "And the LORD appeared to him the same night and said, “I am the God of your father Abraham; do not fear, for I am with you. I will bless you and multiply your descendants for My servant Abraham’s sake.”"
      }
    ]
  },
{
  "weekNumber": 3,
  "weekLabel": "Week 3 — January 19–23",
  "days": [
    {
      "id": "w3d1",
      "dayOfWeek": "Monday",
      "dateLabel": "January 19",
      "readings": "Gen 28–29; Mark 11",
      "summary": "Jacob encounters God at Bethel and begins his years of service with Laban, while Jesus enters Jerusalem as the promised Messiah and teaches about true faith and fruitfulness.",
      "keyVerseRef": "Genesis 28:15 (NKJV)",
      "keyVerseText": "Behold, I am with you and will keep you wherever you go, and will bring you back to this land; for I will not leave you until I have done what I have spoken to you."
    },
    {
      "id": "w3d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "January 20",
      "readings": "Gen 30–31; Ps 11; Mark 12",
      "summary": "God prospers Jacob despite tension and deceit, showing His covenant faithfulness, while Jesus teaches the greatest commandments—love God with all your heart, and love your neighbor as yourself.",
      "keyVerseRef": "Mark 12:30–31 (NKJV)",
      "keyVerseText": "‘And you shall love the LORD your God with all your heart, with all your soul, with all your mind, and with all your strength.’ This is the first commandment. And the second, like it, is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these."
    },
    {
      "id": "w3d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "January 21",
      "readings": "Gen 32–34; Ps 145; Mark 13",
      "summary": "Jacob wrestles with God and receives a new name—Israel. Reconciliation with Esau displays grace triumphing over fear, and Jesus speaks of the end times, calling His people to watch and endure.",
      "keyVerseRef": "Genesis 32:28 (NKJV)",
      "keyVerseText": "And He said, “Your name shall no longer be called Jacob, but Israel; for you have struggled with God and with men, and have prevailed.”"
    },
    {
      "id": "w3d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "January 22",
      "readings": "Gen 35–37; Ps 12; Mark 14",
      "summary": "God reaffirms His covenant with Jacob; Joseph is betrayed by his brothers yet remains central to God’s plan, while Jesus prepares for the cross—the ultimate betrayal that will bring salvation.",
      "keyVerseRef": "Genesis 35:11 (NKJV)",
      "keyVerseText": "Also God said to him: “I am God Almighty. Be fruitful and multiply; a nation and a company of nations shall proceed from you, and kings shall come from your body.”"
    },
    {
      "id": "w3d5",
      "dayOfWeek": "Friday",
      "dateLabel": "January 23",
      "readings": "Gen 38–40; Mark 15",
      "summary": "God works through broken people as Judah’s line moves toward Messiah, and Joseph rises through suffering to a place of influence—pointing to Christ, the innocent One condemned yet victorious.",
      "keyVerseRef": "Mark 15:39 (NKJV)",
      "keyVerseText": "So when the centurion, who stood opposite Him, saw that He cried out like this and breathed His last, he said, “Truly this Man was the Son of God!”"
    }
  ]
},
{
  "weekNumber": 4,
  "weekLabel": "Week 4 — January 26–30",
  "days": [
    {
      "id": "w4d1",
      "dayOfWeek": "Monday",
      "dateLabel": "January 26",
      "readings": "Gen 41–42; Mark 16",
      "summary": "Joseph interprets Pharaoh’s dreams and rises to power, saving many lives. His brothers come seeking grain, beginning a powerful story of grace and reconciliation. Christ is risen—our salvation and hope.",
      "keyVerseRef": "Mark 16:6 (NKJV)",
      "keyVerseText": "But he said to them, “Do not be alarmed. You seek Jesus of Nazareth, who was crucified. He is risen! He is not here.”"
    },
    {
      "id": "w4d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "January 27",
      "readings": "Gen 43–44; Ps 24; Gal 1",
      "summary": "Joseph tests his brothers and reveals the transformation of Judah, while Psalm 24 declares God’s glory and Paul defends the true gospel—Christ’s work alone saves.",
      "keyVerseRef": "Galatians 1:10 (NKJV)",
      "keyVerseText": "For do I now persuade men, or God? Or do I seek to please men? For if I still pleased men, I would not be a bondservant of Christ."
    },
    {
      "id": "w4d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "January 28",
      "readings": "Gen 45–46; Ps 108; Gal 2",
      "summary": "Joseph reveals himself and extends forgiveness, restoring what was broken for God’s glory. Israel moves to Egypt in faith. Paul confronts hypocrisy, affirming justification by faith alone.",
      "keyVerseRef": "Genesis 45:5 (NKJV)",
      "keyVerseText": "But now, do not therefore be grieved or angry with yourselves because you sold me here; for God sent me before you to preserve life."
    },
    {
      "id": "w4d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "January 29",
      "readings": "Gen 47–48; Ps 25; Gal 3",
      "summary": "Israel blesses Joseph’s sons by faith, giving Ephraim greater honor. God’s covenant promise continues through generations. Paul teaches that righteousness comes through faith—not law.",
      "keyVerseRef": "Galatians 3:29 (NKJV)",
      "keyVerseText": "And if you are Christ’s, then you are Abraham’s seed, and heirs according to the promise."
    },
    {
      "id": "w4d5",
      "dayOfWeek": "Friday",
      "dateLabel": "January 30",
      "readings": "Gen 49–50; Gal 4",
      "summary": "Jacob blesses his sons, prophesying kingship through Judah and pointing to the Messiah. Joseph’s death points forward to deliverance yet to come. In Christ we are adopted as sons and heirs.",
      "keyVerseRef": "Galatians 4:7 (NKJV)",
      "keyVerseText": "Therefore you are no longer a slave but a son, and if a son, then an heir of God through Christ."
    }
  ]
},
{
  "weekNumber": 5,
  "weekLabel": "Week 5 — February 2–6",
  "days": [
    {
      "id": "w5d1",
      "dayOfWeek": "Monday",
      "dateLabel": "February 2",
      "readings": "Ex 1–3; Gal 5",
      "summary": "Israel suffers under bondage, but God remembers His covenant. Moses is called through the burning bush to deliver His people. In Galatians we are called to freedom through the Spirit, not works of the flesh.",
      "keyVerseRef": "Exodus 3:14 (NKJV)",
      "keyVerseText": "And God said to Moses, “I AM WHO I AM.” And He said, “Thus you shall say to the children of Israel, ‘I AM has sent me to you.’ ”"
    },
    {
      "id": "w5d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "February 3",
      "readings": "Ex 4–6; Gal 6",
      "summary": "Moses returns to Egypt in obedience, but Pharaoh resists. God reveals His name—Yahweh—as the One who keeps covenant. In Galatians we reap what we sow and bear one another’s burdens.",
      "keyVerseRef": "Galatians 6:9 (NKJV)",
      "keyVerseText": "And let us not grow weary while doing good, for in due season we shall reap if we do not lose heart."
    },
    {
      "id": "w5d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "February 4",
      "readings": "Ex 7–9; Ps 105; Eph 1",
      "summary": "God sends plagues demonstrating His power over Egypt. Psalm 105 recalls His faithful works, and Ephesians declares believers chosen in Christ from before the foundation of the world.",
      "keyVerseRef": "Ephesians 1:7 (NKJV)",
      "keyVerseText": "In Him we have redemption through His blood, the forgiveness of sins, according to the riches of His grace."
    },
    {
      "id": "w5d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "February 5",
      "readings": "Ex 10–12; Eph 2",
      "summary": "The Passover reveals salvation through the blood of the lamb—pointing to Christ. God delivers His people by mighty power. We are saved by grace through faith, not works.",
      "keyVerseRef": "Ephesians 2:8–9 (NKJV)",
      "keyVerseText": "For by grace you have been saved through faith, and that not of yourselves; it is the gift of God, not of works, lest anyone should boast."
    },
    {
      "id": "w5d5",
      "dayOfWeek": "Friday",
      "dateLabel": "February 6",
      "readings": "Ex 13–15; Ps 114; Eph 3",
      "summary": "Israel crosses the Red Sea and God defeats the enemy. Miriam sings praise. Psalm 114 remembers the great deliverance, while Ephesians reveals the mystery of salvation for all nations.",
      "keyVerseRef": "Exodus 14:14 (NKJV)",
      "keyVerseText": "The LORD will fight for you, and you shall hold your peace."
    }
  ]
},
{
  "weekNumber": 6,
  "weekLabel": "Week 6 — February 9–13",
  "days": [
    {
      "id": "w6d1",
      "dayOfWeek": "Monday",
      "dateLabel": "February 9",
      "readings": "Ex 16–18; Eph 4",
      "summary": "God provides manna in the wilderness and water from the rock, teaching His people dependence and obedience. In Ephesians we are called to unity, maturity, and love.",
      "keyVerseRef": "Exodus 16:4 (NKJV)",
      "keyVerseText": "Then the LORD said to Moses, “Behold, I will rain bread from heaven for you. And the people shall go out and gather a certain quota every day.”"
    },
    {
      "id": "w6d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "February 10",
      "readings": "Ex 19–21; Ps 33; Eph 5",
      "summary": "God gives the law at Sinai, declaring Israel His treasured possession. Psalm 33 celebrates His power and faithfulness, while Ephesians calls believers to walk in love and purity.",
      "keyVerseRef": "Exodus 19:5 (NKJV)",
      "keyVerseText": "Now therefore, if you will indeed obey My voice and keep My covenant, then you shall be a special treasure to Me above all people."
    },
    {
      "id": "w6d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "February 11",
      "readings": "Ex 22–24; Ps 109; Eph 6",
      "summary": "God establishes justice and covenant law, and the people pledge obedience. Psalm 109 cries for righteous judgment. In Ephesians we take up the armor of God for victory in spiritual warfare.",
      "keyVerseRef": "Ephesians 6:11 (NKJV)",
      "keyVerseText": "Put on the whole armor of God, that you may be able to stand against the wiles of the devil."
    },
    {
      "id": "w6d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "February 12",
      "readings": "Ex 25–27; Ps 90; Phil 1",
      "summary": "God gives instructions for the tabernacle—where He will dwell among His people. Psalm 90 contrasts human frailty with God’s eternal strength. Philippians rejoices even in hardship.",
      "keyVerseRef": "Philippians 1:6 (NKJV)",
      "keyVerseText": "Being confident of this very thing, that He who has begun a good work in you will complete it until the day of Jesus Christ."
    },
    {
      "id": "w6d5",
      "dayOfWeek": "Friday",
      "dateLabel": "February 13",
      "readings": "Ex 28–31; Phil 2",
      "summary": "God sets apart priests for holy service and establishes Sabbath rest. Christ is our High Priest and humble Servant. Philippians calls believers to have the mind of Christ.",
      "keyVerseRef": "Philippians 2:5 (NKJV)",
      "keyVerseText": "Let this mind be in you which was also in Christ Jesus."
    }
  ]
},
{
  "weekNumber": 7,
  "weekLabel": "Week 7 — February 16–20",
  "days": [
    {
      "id": "w7d1",
      "dayOfWeek": "Monday",
      "dateLabel": "February 16",
      "readings": "Ex 32–34; Phil 3",
      "summary": "Israel falls into idolatry with the golden calf, yet Moses intercedes and God renews His covenant. Paul presses on to know Christ above all else, counting everything else as loss.",
      "keyVerseRef": "Exodus 33:14 (NKJV)",
      "keyVerseText": "And He said, “My Presence will go with you, and I will give you rest.”"
    },
    {
      "id": "w7d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "February 17",
      "readings": "Ex 35–37; Ps 26; Phil 4",
      "summary": "The people generously give for the tabernacle and gifted artisans build what God designed. David prays for integrity, and Paul calls believers to rejoice, pray, and rest in God’s peace.",
      "keyVerseRef": "Philippians 4:6–7 (NKJV)",
      "keyVerseText": "Be anxious for nothing, but in everything by prayer and supplication, with thanksgiving, let your requests be made known to God; and the peace of God, which surpasses all understanding, will guard your hearts and minds through Christ Jesus."
    },
    {
      "id": "w7d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "February 18",
      "readings": "Ex 38–40; Heb 1",
      "summary": "The tabernacle is completed and God’s glory fills it, dwelling in the midst of His people. Hebrews proclaims Jesus as the exact representation of God’s nature and the One who purged our sins.",
      "keyVerseRef": "Hebrews 1:3 (NKJV)",
      "keyVerseText": "Who being the brightness of His glory and the express image of His person, and upholding all things by the word of His power, when He had by Himself purged our sins, sat down at the right hand of the Majesty on high."
    },
    {
      "id": "w7d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "February 19",
      "readings": "Lev 1–3; Ps 27; Heb 2",
      "summary": "God establishes offerings that point to atonement and fellowship with Him. David declares the Lord as his light and salvation. Hebrews warns us not to neglect such a great salvation in Christ.",
      "keyVerseRef": "Hebrews 2:3 (NKJV)",
      "keyVerseText": "How shall we escape if we neglect so great a salvation, which at the first began to be spoken by the Lord, and was confirmed to us by those who heard Him."
    },
    {
      "id": "w7d5",
      "dayOfWeek": "Friday",
      "dateLabel": "February 20",
      "readings": "Lev 4–7; Heb 3",
      "summary": "Sin and guilt offerings show the seriousness of sin and God’s provision for forgiveness. Hebrews urges us to hold fast our confidence in Christ and not harden our hearts as Israel did.",
      "keyVerseRef": "Hebrews 3:1 (NKJV)",
      "keyVerseText": "Therefore, holy brethren, partakers of the heavenly calling, consider the Apostle and High Priest of our confession, Christ Jesus."
    }
  ]
},
{
  "weekNumber": 8,
  "weekLabel": "Week 8 — February 23–27",
  "days": [
    {
      "id": "w8d1",
      "dayOfWeek": "Monday",
      "dateLabel": "February 23",
      "readings": "Lev 8–11; Ps 110; Heb 4",
      "summary": "Priests are consecrated for holy service, and God distinguishes between clean and unclean. Psalm 110 points to a priest-king Messiah. Hebrews calls us to enter God’s rest and draw near with confidence.",
      "keyVerseRef": "Hebrews 4:16 (NKJV)",
      "keyVerseText": "Let us therefore come boldly to the throne of grace, that we may obtain mercy and find grace to help in time of need."
    },
    {
      "id": "w8d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "February 24",
      "readings": "Lev 12–14; Ps 111; Heb 5",
      "summary": "Laws about uncleanness and leprosy highlight God’s concern for holiness and community life. Psalm 111 praises His works. Hebrews presents Jesus as the compassionate High Priest who learned obedience.",
      "keyVerseRef": "Hebrews 5:9 (NKJV)",
      "keyVerseText": "And having been perfected, He became the author of eternal salvation to all who obey Him."
    },
    {
      "id": "w8d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "February 25",
      "readings": "Lev 15–18; Ps 31; Heb 6",
      "summary": "God gives laws for purity, blood, and sexual holiness, calling His people to be distinct. Psalm 31 trusts in God amid trouble. Hebrews urges maturity and anchors our hope in God’s unchanging promise.",
      "keyVerseRef": "Hebrews 6:19 (NKJV)",
      "keyVerseText": "This hope we have as an anchor of the soul, both sure and steadfast, and which enters the Presence behind the veil."
    },
    {
      "id": "w8d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "February 26",
      "readings": "Lev 19–20; Heb 7",
      "summary": "God calls His people to practical holiness in relationships, justice, and worship. Hebrews shows Jesus as our eternal High Priest who lives to make intercession for us.",
      "keyVerseRef": "Hebrews 7:25 (NKJV)",
      "keyVerseText": "Therefore He is also able to save to the uttermost those who come to God through Him, since He always lives to make intercession for them."
    },
    {
      "id": "w8d5",
      "dayOfWeek": "Friday",
      "dateLabel": "February 27",
      "readings": "Lev 21–23; Heb 8",
      "summary": "Priests are called to holiness and the appointed feasts are outlined, all pointing to God’s redemptive plan. Hebrews proclaims Jesus as mediator of a better covenant with better promises.",
      "keyVerseRef": "Hebrews 8:6 (NKJV)",
      "keyVerseText": "But now He has obtained a more excellent ministry, inasmuch as He is also Mediator of a better covenant, which was established on better promises."
    }
  ]
},
{
  "weekNumber": 9,
  "weekLabel": "Week 9 — March 2–6",
  "days": [
    {
      "id": "w9d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 2",
      "readings": "Lev 24–25; Ps 81; Heb 9",
      "summary": "God calls His people to holiness, justice, and Sabbath rest, including the Year of Jubilee that restores what was lost. Psalm 81 urges God’s people to listen and trust Him. Hebrews 9 shows Jesus as our great High Priest whose once-for-all sacrifice brings eternal redemption.",
      "keyVerseRef": "Hebrews 9:12 (NKJV)",
      "keyVerseText": "Not with the blood of goats and calves, but with His own blood He entered the Most Holy Place once for all, having obtained eternal redemption."
    },
    {
      "id": "w9d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 3",
      "readings": "Lev 26–27; Ps 112; Heb 10",
      "summary": "God sets before Israel blessings for obedience and curses for rebellion, yet remembers His covenant. Psalm 112 praises the righteous who fear the LORD. Hebrews 10 points to Christ’s perfect sacrifice and urges us to hold fast our hope.",
      "keyVerseRef": "Hebrews 10:23 (NKJV)",
      "keyVerseText": "Let us hold fast the confession of our hope without wavering, for He who promised is faithful."
    },
    {
      "id": "w9d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "March 4",
      "readings": "Num 1–2; Ps 64; Heb 11",
      "summary": "Israel is counted and arranged around the tabernacle, with God at the center of their camp. Psalm 64 appeals to God for protection from the wicked. Hebrews 11 celebrates men and women of faith who trusted God’s promises even when they could not see the outcome.",
      "keyVerseRef": "Hebrews 11:1 (NKJV)",
      "keyVerseText": "Now faith is the substance of things hoped for, the evidence of things not seen."
    },
    {
      "id": "w9d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "March 5",
      "readings": "Num 3–5; Heb 12",
      "summary": "The Levites are set apart to serve and guard the tabernacle, and the camp is kept pure. Hebrews 12 calls us to run with endurance, fixing our eyes on Jesus and receiving the Father’s loving discipline.",
      "keyVerseRef": "Hebrews 12:1–2 (NKJV)",
      "keyVerseText": "Therefore we also, since we are surrounded by so great a cloud of witnesses, let us lay aside every weight, and the sin which so easily ensnares us, and let us run with endurance the race that is set before us, looking unto Jesus, the author and finisher of our faith."
    },
    {
      "id": "w9d5",
      "dayOfWeek": "Friday",
      "dateLabel": "March 6",
      "readings": "Num 6–7; Heb 13",
      "summary": "The Nazirite vow and priestly blessing highlight a life set apart to God and His desire to put His name on His people. Offerings are brought for the altar’s dedication. Hebrews 13 calls believers to worshipful lives, trusting Jesus who never changes.",
      "keyVerseRef": "Hebrews 13:20–21 (NKJV)",
      "keyVerseText": "Now may the God of peace who brought up our Lord Jesus from the dead, that great Shepherd of the sheep, through the blood of the everlasting covenant, make you complete in every good work to do His will, working in you what is well pleasing in His sight, through Jesus Christ, to whom be glory forever and ever. Amen."
    }
  ]
},
{
  "weekNumber": 10,
  "weekLabel": "Week 10 — March 9–13",
  "days": [
    {
      "id": "w10d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 9",
      "readings": "Num 8–11; Col 1",
      "summary": "The Levites are cleansed for service, Israel keeps the Passover, and God guides His people by cloud and fire. Complaints in the wilderness reveal unbelief, yet God still provides. Colossians 1 exalts Christ as supreme over creation and the head of the church.",
      "keyVerseRef": "Colossians 1:13–14 (NKJV)",
      "keyVerseText": "He has delivered us from the power of darkness and conveyed us into the kingdom of the Son of His love, in whom we have redemption through His blood, the forgiveness of sins."
    },
    {
      "id": "w10d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 10",
      "readings": "Num 12–14; Ps 28; Col 2",
      "summary": "Miriam and Aaron oppose Moses and are corrected by God. The spies’ bad report leads Israel to rebel at the edge of the promised land. Psalm 28 cries out for mercy and strength. Colossians 2 proclaims the fullness of Christ and warns against deceptive substitutes.",
      "keyVerseRef": "Colossians 2:9–10 (NKJV)",
      "keyVerseText": "For in Him dwells all the fullness of the Godhead bodily; and you are complete in Him, who is the head of all principality and power."
    },
    {
      "id": "w10d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "March 11",
      "readings": "Num 15–18; Ps 113; Col 3",
      "summary": "God reinforces His commands, judges rebellion in Korah’s uprising, and confirms Aaron’s priesthood. Psalm 113 praises the LORD who lifts the lowly. Colossians 3 calls believers to seek things above and live out the new life in Christ.",
      "keyVerseRef": "Colossians 3:1–2 (NKJV)",
      "keyVerseText": "If then you were raised with Christ, seek those things which are above, where Christ is, sitting at the right hand of God. Set your mind on things above, not on things on the earth."
    },
    {
      "id": "w10d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "March 12",
      "readings": "Num 19–21; Col 4",
      "summary": "The red heifer offering provides cleansing from death’s defilement. Moses fails to honor God at Meribah, and Israel looks to the bronze serpent for healing. God grants victories on the way. Colossians 4 exhorts believers to steadfast prayer and wise witness.",
      "keyVerseRef": "Colossians 4:2 (NKJV)",
      "keyVerseText": "Continue earnestly in prayer, being vigilant in it with thanksgiving."
    },
    {
      "id": "w10d5",
      "dayOfWeek": "Friday",
      "dateLabel": "March 13",
      "readings": "Num 22–25; Luke 1",
      "summary": "Balak hires Balaam to curse Israel, but God turns the curse into blessing. Yet Israel falls into sin with Moab. Luke 1 shows God unfolding His plan of salvation through the births of John the Baptist and Jesus, the promised King.",
      "keyVerseRef": "Luke 1:32–33 (NKJV)",
      "keyVerseText": "He will be great, and will be called the Son of the Highest; and the Lord God will give Him the throne of His father David. And He will reign over the house of Jacob forever, and of His kingdom there will be no end."
    }
  ]
},
{
  "weekNumber": 11,
  "weekLabel": "Week 11 — March 16–20",
  "days": [
    {
      "id": "w11d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 16",
      "readings": "Num 26–29; Luke 2",
      "summary": "Israel is numbered again and offerings are appointed as the people prepare for the promised land. In Luke 2, Jesus is born, presented in the temple, and recognized as God’s salvation for all peoples.",
      "keyVerseRef": "Luke 2:11 (NKJV)",
      "keyVerseText": "For there is born to you this day in the city of David a Savior, who is Christ the Lord."
    },
    {
      "id": "w11d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 17",
      "readings": "Num 30–33; Ps 35; Luke 3",
      "summary": "God gives instructions about vows and recounts Israel’s journey from Egypt to the edge of Canaan. Psalm 35 cries out for justice. In Luke 3, John prepares the way and Jesus is baptized, affirmed by the Father and the Spirit.",
      "keyVerseRef": "Luke 3:22 (NKJV)",
      "keyVerseText": "And the Holy Spirit descended in bodily form like a dove upon Him, and a voice came from heaven which said, “You are My beloved Son; in You I am well pleased.”"
    },
    {
      "id": "w11d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "March 18",
      "readings": "Num 34–36; Luke 4",
      "summary": "The boundaries of the land and cities of refuge are appointed, showing God’s concern for justice and inheritance. In Luke 4, Jesus overcomes temptation and begins His ministry, proclaiming good news and freedom.",
      "keyVerseRef": "Luke 4:18 (NKJV)",
      "keyVerseText": "“The Spirit of the LORD is upon Me, because He has anointed Me to preach the gospel to the poor; He has sent Me to heal the brokenhearted, to proclaim liberty to the captives and recovery of sight to the blind, to set at liberty those who are oppressed.”"
    },
    {
      "id": "w11d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "March 19",
      "readings": "Deut 1–3; Ps 36; Luke 5",
      "summary": "Moses reviews Israel’s history of failure and God’s faithfulness as they stand ready to enter the land. Psalm 36 contrasts human wickedness with God’s steadfast love. In Luke 5, Jesus calls disciples, heals, and forgives sins.",
      "keyVerseRef": "Luke 5:10 (NKJV)",
      "keyVerseText": "And Jesus said to Simon, “Do not be afraid. From now on you will catch men.”"
    },
    {
      "id": "w11d5",
      "dayOfWeek": "Friday",
      "dateLabel": "March 20",
      "readings": "Deut 4–5; Luke 6",
      "summary": "God calls Israel to remember His mighty acts, obey His commands, and teach their children diligently. The Ten Commandments are reviewed. In Luke 6, Jesus teaches about true discipleship and a life built on His words.",
      "keyVerseRef": "Luke 6:46 (NKJV)",
      "keyVerseText": "“But why do you call Me ‘Lord, Lord,’ and not do the things which I say?”"
    }
  ]
},
{
  "weekNumber": 12,
  "weekLabel": "Week 12 — March 23–27",
  "days": [
    {
      "id": "w12d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 23",
      "readings": "Deut 6–9; Luke 7",
      "summary": "Moses commands Israel to love the LORD wholeheartedly, remember His Word, and not forget Him in prosperity. In Luke 7, Jesus heals, raises the dead, and forgives a sinful woman who loves much.",
      "keyVerseRef": "Deuteronomy 6:5 (NKJV)",
      "keyVerseText": "You shall love the LORD your God with all your heart, with all your soul, and with all your strength."
    },
    {
      "id": "w12d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 24",
      "readings": "Deut 10–14; Ps 5; Luke 8",
      "summary": "God calls Israel to fear Him, walk in His ways, and care for the vulnerable, living as a holy people. Psalm 5 cries out for guidance. In Luke 8, Jesus calms storms, casts out demons, and responds to personal faith.",
      "keyVerseRef": "Deuteronomy 10:12 (NKJV)",
      "keyVerseText": "And now, Israel, what does the LORD your God require of you, but to fear the LORD your God, to walk in all His ways and to love Him, to serve the LORD your God with all your heart and with all your soul."
    },
    {
      "id": "w12d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "March 25",
      "readings": "Deut 15–18; Ps 115; Luke 9",
      "summary": "God instructs His people about generosity, release, and leadership, promising a coming Prophet like Moses. Psalm 115 contrasts lifeless idols with the living God. In Luke 9, Jesus calls His followers to deny themselves and take up their cross daily.",
      "keyVerseRef": "Luke 9:23 (NKJV)",
      "keyVerseText": "Then He said to them all, “If anyone desires to come after Me, let him deny himself, and take up his cross daily, and follow Me.”"
    },
    {
      "id": "w12d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "March 26",
      "readings": "Deut 19–22; Ps 6; Luke 10",
      "summary": "God provides laws for justice, protection of the innocent, and care in relationships. Psalm 6 is a cry for mercy in distress. In Luke 10, Jesus sends out the seventy and teaches the parable of the Good Samaritan, calling us to love our neighbor.",
      "keyVerseRef": "Luke 10:27 (NKJV)",
      "keyVerseText": "So he answered and said, “ ‘You shall love the LORD your God with all your heart, with all your soul, with all your strength, and with all your mind,’ and ‘your neighbor as yourself.’ ”"
    },
    {
      "id": "w12d5",
      "dayOfWeek": "Friday",
      "dateLabel": "March 27",
      "readings": "Deut 23–26; Luke 11",
      "summary": "God gives instructions for holiness in community, worship, and offerings, including the confession of His saving work. In Luke 11, Jesus teaches on prayer and warns against hypocrisy and unbelief.",
      "keyVerseRef": "Luke 11:9 (NKJV)",
      "keyVerseText": "“So I say to you, ask, and it will be given to you; seek, and you will find; knock, and it will be opened to you.”"
    }
  ]
},
{
  "weekNumber": 13,
  "weekLabel": "Week 13 — March 30–April 3",
  "days": [
    {
      "id": "w13d1",
      "dayOfWeek": "Monday",
      "dateLabel": "March 30",
      "readings": "Deut 27–31; Luke 12",
      "summary": "Blessings and curses are set before Israel, and Moses urges them to choose life and love the Lord with all their heart. In Luke 12, Jesus calls His followers to fearless trust and wholehearted devotion to the kingdom.",
      "keyVerseRef": "Deuteronomy 30:19 (NKJV)",
      "keyVerseText": "I call heaven and earth as witnesses today against you, that I have set before you life and death, blessing and cursing; therefore choose life, that both you and your descendants may live."
    },
    {
      "id": "w13d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "March 31",
      "readings": "Deut 32–34; Ps 13; Luke 13",
      "summary": "Moses’ song testifies to God’s faithfulness and Israel’s unfaithfulness, yet God is the Rock of salvation. Moses blesses the tribes and dies viewing the land. Psalm 13 moves from anguish to trust, and Luke 13 calls for repentance and fruitfulness.",
      "keyVerseRef": "Deuteronomy 32:4 (NKJV)",
      "keyVerseText": "He is the Rock, His work is perfect; for all His ways are justice, a God of truth and without injustice; righteous and upright is He."
    },
    {
      "id": "w13d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "April 1",
      "readings": "Josh 1–4; Ps 143; Luke 14",
      "summary": "Joshua is commissioned to lead God’s people into the land, encouraged to be strong and courageous in God’s Word. Israel crosses the Jordan by God’s power. Psalm 143 cries for mercy. In Luke 14, Jesus calls us to count the cost of discipleship.",
      "keyVerseRef": "Joshua 1:9 (NKJV)",
      "keyVerseText": "Have I not commanded you? Be strong and of good courage; do not be afraid, nor be dismayed, for the LORD your God is with you wherever you go."
    },
    {
      "id": "w13d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "April 2",
      "readings": "Josh 5–8; Ps 14; Luke 15",
      "summary": "Israel renews covenant signs, and the Commander of the Lord’s army appears to Joshua. God brings down Jericho’s walls, judges sin in the camp, and grants victory. Psalm 14 exposes human folly. Luke 15 reveals the Father’s joy in seeking the lost.",
      "keyVerseRef": "Luke 15:10 (NKJV)",
      "keyVerseText": "Likewise, I say to you, there is joy in the presence of the angels of God over one sinner who repents."
    },
    {
      "id": "w13d5",
      "dayOfWeek": "Friday",
      "dateLabel": "April 3",
      "readings": "Josh 9–13; Luke 16",
      "summary": "Joshua leads Israel through battles and allotments of the land; despite failures like the Gibeonite deception, God’s promises stand. In Luke 16, Jesus teaches about faithfulness with worldly wealth and living in light of eternity.",
      "keyVerseRef": "Luke 16:10 (NKJV)",
      "keyVerseText": "He who is faithful in what is least is faithful also in much; and he who is unjust in what is least is unjust also in much."
    }
  ]
},
{
  "weekNumber": 14,
  "weekLabel": "Week 14 — April 6–10",
  "days": [
    {
      "id": "w14d1",
      "dayOfWeek": "Monday",
      "dateLabel": "April 6",
      "readings": "Josh 14–17; Luke 17",
      "summary": "Caleb’s faith is rewarded as he asks for the mountain God promised. The land continues to be divided among the tribes. In Luke 17, Jesus teaches about faith, gratitude, and the coming of the kingdom.",
      "keyVerseRef": "Joshua 14:12 (NKJV)",
      "keyVerseText": "Now therefore, give me this mountain of which the LORD spoke in that day; for you heard in that day how the Anakim were there, and that the cities were great and fortified. It may be that the LORD will be with me, and I shall be able to drive them out as the LORD said."
    },
    {
      "id": "w14d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "April 7",
      "readings": "Josh 18–21; Ps 15; Luke 18",
      "summary": "The remaining land is allotted, cities of refuge are appointed, and the Lord gives Israel rest on every side. Psalm 15 describes the one who dwells in God’s presence. In Luke 18, Jesus teaches persistent prayer and humble faith.",
      "keyVerseRef": "Joshua 21:45 (NKJV)",
      "keyVerseText": "Not a word failed of any good thing which the LORD had spoken to the house of Israel. All came to pass."
    },
    {
      "id": "w14d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "April 8",
      "readings": "Josh 22–24; Ps 116; Luke 19",
      "summary": "Joshua exhorts Israel to cling to the Lord and reject idols, declaring that he and his house will serve the Lord. Psalm 116 thanks God for deliverance. Luke 19 shows Jesus seeking the lost and weeping over Jerusalem.",
      "keyVerseRef": "Joshua 24:15 (NKJV)",
      "keyVerseText": "But as for me and my house, we will serve the LORD."
    },
    {
      "id": "w14d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "April 9",
      "readings": "Judg 1–3; Ps 16; Luke 20",
      "summary": "After Joshua’s death, incomplete obedience leads to ongoing enemies. God raises judges to deliver His people when they cry out. Psalm 16 rejoices in the Lord as our portion. In Luke 20, Jesus’ authority is challenged, yet He reveals Himself as the cornerstone.",
      "keyVerseRef": "Judges 2:18 (NKJV)",
      "keyVerseText": "And when the LORD raised up judges for them, the LORD was with the judge and delivered them out of the hand of their enemies all the days of the judge."
    },
    {
      "id": "w14d5",
      "dayOfWeek": "Friday",
      "dateLabel": "April 10",
      "readings": "Judg 4–6; Luke 21",
      "summary": "God uses Deborah and Barak to deliver Israel, and calls Gideon in weakness to lead. The Lord shows His power through unlikely instruments. In Luke 21, Jesus speaks about the end times and calls His followers to watch and pray.",
      "keyVerseRef": "Judges 6:12 (NKJV)",
      "keyVerseText": "And the Angel of the LORD appeared to him, and said to him, \"The LORD is with you, you mighty man of valor!\""
    }
  ]
},
{
  "weekNumber": 15,
  "weekLabel": "Week 15 — April 13–17",
  "days": [
    {
      "id": "w15d1",
      "dayOfWeek": "Monday",
      "dateLabel": "April 13",
      "readings": "Judg 7–8; Luke 22",
      "summary": "God delivers Israel from Midian with a small, unlikely army so that He alone gets the glory. Gideon later struggles with success. In Luke 22, Jesus shares the Passover, institutes the Lord’s Supper, and prepares for the cross.",
      "keyVerseRef": "Judges 7:2 (NKJV)",
      "keyVerseText": "And the LORD said to Gideon, \"The people who are with you are too many for Me to give the Midianites into their hands, lest Israel claim glory for itself against Me, saying, 'My own hand has saved me.'\""
    },
    {
      "id": "w15d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "April 14",
      "readings": "Judg 9–11; Ps 17; Luke 23",
      "summary": "Abimelech’s violent rule and Jephthah’s tragic vow reveal the brokenness of Israel when everyone does what is right in his own eyes. Psalm 17 is a cry for vindication. In Luke 23, Jesus is crucified yet prays for His enemies and promises paradise to a repentant thief.",
      "keyVerseRef": "Luke 23:34 (NKJV)",
      "keyVerseText": "Then Jesus said, \"Father, forgive them, for they do not know what they do.\""
    },
    {
      "id": "w15d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "April 15",
      "readings": "Judg 12–16; Ps 146; Luke 24",
      "summary": "More judges rise and fall, and Samson’s story shows a man with great strength but many weaknesses. Yet God works through him to begin delivering Israel. Psalm 146 praises the Lord who helps the oppressed. In Luke 24, the risen Christ opens the Scriptures and hearts.",
      "keyVerseRef": "Luke 24:32 (NKJV)",
      "keyVerseText": "And they said to one another, \"Did not our heart burn within us while He talked with us on the road, and while He opened the Scriptures to us?\""
    },
    {
      "id": "w15d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "April 16",
      "readings": "Judg 17–18; Ps 21; Acts 1",
      "summary": "Micah’s idol and the migration of the tribe of Dan show spiritual confusion when there is no king in Israel. Psalm 21 thanks God for His saving strength. In Acts 1, the risen Jesus commissions His disciples to be His witnesses in the power of the Holy Spirit.",
      "keyVerseRef": "Acts 1:8 (NKJV)",
      "keyVerseText": "But you shall receive power when the Holy Spirit has come upon you; and you shall be witnesses to Me in Jerusalem, and in all Judea and Samaria, and to the end of the earth."
    },
    {
      "id": "w15d5",
      "dayOfWeek": "Friday",
      "dateLabel": "April 17",
      "readings": "Judg 19–21; Acts 2",
      "summary": "The dark events in Israel reveal just how far the nation has fallen without godly leadership. Yet God will later raise up kings and, ultimately, Christ. In Acts 2, the Spirit is poured out, the gospel is preached, and many are added to Christ’s church.",
      "keyVerseRef": "Acts 2:21 (NKJV)",
      "keyVerseText": "And it shall come to pass that whoever calls on the name of the LORD shall be saved."
    }
  ]
},
{
  "weekNumber": 16,
  "weekLabel": "Week 16 — April 20–24",
  "days": [
    {
      "id": "w16d1",
      "dayOfWeek": "Monday",
      "dateLabel": "April 20",
      "readings": "Ruth 1–2; Acts 3",
      "summary": "Ruth, a Moabite widow, clings to Naomi and to the God of Israel, finding favor in Boaz’s field. God is quietly at work in ordinary faithfulness. In Acts 3, a lame man is healed in Jesus’ name, pointing to the power of the risen Christ.",
      "keyVerseRef": "Ruth 1:16 (NKJV)",
      "keyVerseText": "But Ruth said: \"Entreat me not to leave you, or to turn back from following after you; for wherever you go, I will go; and wherever you lodge, I will lodge; your people shall be my people, and your God, my God.\""
    },
    {
      "id": "w16d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "April 21",
      "readings": "Ruth 3–4; Ps 37; Acts 4",
      "summary": "Boaz acts as kinsman-redeemer, and Ruth becomes part of the family line leading to David and ultimately to Christ. Psalm 37 encourages trust in the Lord despite evildoers. In Acts 4, the apostles boldly proclaim Jesus despite opposition.",
      "keyVerseRef": "Acts 4:12 (NKJV)",
      "keyVerseText": "Nor is there salvation in any other, for there is no other name under heaven given among men by which we must be saved."
    },
    {
      "id": "w16d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "April 22",
      "readings": "1 Sam 1–2; Ps 120; Acts 5",
      "summary": "Hannah prays in her bitterness and God gives her a son, Samuel, whom she dedicates to the Lord. Her song celebrates God’s sovereign reversals. Psalm 120 cries out from distress. In Acts 5, God purifies His church and the apostles continue to preach with power.",
      "keyVerseRef": "1 Samuel 1:27–28 (NKJV)",
      "keyVerseText": "For this child I prayed, and the LORD has granted me my petition which I asked of Him. Therefore I also have lent him to the LORD; as long as he lives he shall be lent to the LORD."
    },
    {
      "id": "w16d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "April 23",
      "readings": "1 Sam 3–5; Ps 23; Acts 6",
      "summary": "The Lord calls Samuel and confirms him as a prophet, while Israel suffers defeat and the ark is captured due to their disobedience. Psalm 23 pictures the Lord as our shepherd. In Acts 6, the church appoints servants so that the Word and prayer can remain central.",
      "keyVerseRef": "1 Samuel 3:10 (NKJV)",
      "keyVerseText": "Now the LORD came and stood and called as at other times, \"Samuel! Samuel!\" And Samuel answered, \"Speak, for Your servant hears.\""
    },
    {
      "id": "w16d5",
      "dayOfWeek": "Friday",
      "dateLabel": "April 24",
      "readings": "1 Sam 6–8; Acts 7",
      "summary": "The ark is returned and Samuel leads Israel in repentance and intercession. Later, the people demand a king like the nations, grieving God’s heart. In Acts 7, Stephen recounts Israel’s history and bears witness to Christ, even unto death.",
      "keyVerseRef": "1 Samuel 7:12 (NKJV)",
      "keyVerseText": "Then Samuel took a stone and set it up between Mizpah and Shen, and called its name Ebenezer, saying, \"Thus far the LORD has helped us.\""
    }
  ]
},
{
  "weekNumber": 17,
  "weekLabel": "Week 17 — April 27–May 1",
  "days": [
    {
      "id": "w17d1",
      "dayOfWeek": "Monday",
      "dateLabel": "April 27",
      "readings": "1 Sam 9–10; Acts 8",
      "summary": "Saul is chosen as Israel’s first king, though humble and unsure at first. God equips whom He calls. In Acts 8, the gospel spreads beyond Jerusalem and the Ethiopian eunuch believes and is baptized.",
      "keyVerseRef": "1 Samuel 10:24 (NKJV)",
      "keyVerseText": "And Samuel said to all the people, “Do you see him whom the LORD has chosen, that there is no one like him among all the people?” So all the people shouted and said, “Long live the king!”"
    },
    {
      "id": "w17d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "April 28",
      "readings": "1 Sam 11–13; Ps 38; Acts 9",
      "summary": "Saul rescues Jabesh-Gilead but later falters by disobeying God. Samuel warns that obedience is greater than sacrifice. Psalm 38 is a prayer of repentance. In Acts 9, Jesus stops Saul of Tarsus and transforms him into His servant.",
      "keyVerseRef": "Acts 9:15 (NKJV)",
      "keyVerseText": "But the Lord said to him, “Go, for he is a chosen vessel of Mine to bear My name before Gentiles, kings, and the children of Israel.”"
    },
    {
      "id": "w17d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "April 29",
      "readings": "1 Sam 14; Ps 124; Acts 10",
      "summary": "Jonathan’s bold faith wins victory for Israel while Saul hesitates in fear. Psalm 124 praises God our deliverer. In Acts 10, God reveals that the gospel is for all nations as the Spirit falls on Gentile believers.",
      "keyVerseRef": "Acts 10:34–35 (NKJV)",
      "keyVerseText": "Then Peter opened his mouth and said: “In truth I perceive that God shows no partiality. But in every nation whoever fears Him and works righteousness is accepted by Him.”"
    },
    {
      "id": "w17d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "April 30",
      "readings": "1 Sam 15–16; 1 Chr 1; Ps 39; Acts 11",
      "summary": "Saul rejects God’s word and God rejects Saul as king. David is anointed, a man after God’s heart. 1 Chronicles begins genealogy from Adam. Psalm 39 reflects on life’s brevity. Acts 11 shows the church welcoming Gentile believers.",
      "keyVerseRef": "1 Samuel 16:7 (NKJV)",
      "keyVerseText": "For the LORD does not see as man sees; for man looks at the outward appearance, but the LORD looks at the heart."
    },
    {
      "id": "w17d5",
      "dayOfWeek": "Friday",
      "dateLabel": "May 1",
      "readings": "1 Sam 17; 1 Chr 2; Acts 12",
      "summary": "David steps forward in faith to face Goliath, showing God’s power through weakness. In Chronicles we continue tracing Israel’s roots. In Acts 12, God frees Peter from prison while the church prays earnestly.",
      "keyVerseRef": "1 Samuel 17:47 (NKJV)",
      "keyVerseText": "Then all this assembly shall know that the LORD does not save with sword and spear; for the battle is the LORD’s."
    }
  ]
},
{
  "weekNumber": 18,
  "weekLabel": "Week 18 — May 4–8",
  "days": [
    {
      "id": "w18d1",
      "dayOfWeek": "Monday",
      "dateLabel": "May 4",
      "readings": "1 Sam 18–19; 1 Chr 3; Ps 59; Acts 13",
      "summary": "Saul’s jealousy rises as David prospers. Jonathan shows loyal friendship. Psalm 59 cries for deliverance from enemies. In Acts 13, Paul’s missionary journey begins and the gospel advances with power.",
      "keyVerseRef": "Acts 13:47 (NKJV)",
      "keyVerseText": "For so the Lord has commanded us: “I have set you as a light to the Gentiles, that you should be for salvation to the ends of the earth.”"
    },
    {
      "id": "w18d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "May 5",
      "readings": "1 Sam 20; 1 Chr 4; Ps 56,57,142; Acts 14",
      "summary": "David and Jonathan covenant in love and truth. Psalms of distress reflect David’s heart while pursued. In Acts 14, despite persecution, Paul and Barnabas strengthen new believers and appoint elders in every church.",
      "keyVerseRef": "Psalm 57:1 (NKJV)",
      "keyVerseText": "Be merciful to me, O God, be merciful to me! For my soul trusts in You; and in the shadow of Your wings I will make my refuge."
    },
    {
      "id": "w18d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "May 6",
      "readings": "1 Sam 21–22; 1 Chr 5; Ps 52; Acts 15",
      "summary": "David flees from Saul and gathers followers. Saul slaughters priests at Nob in fury. Psalm 52 trusts God even amid evil. In Acts 15, the Jerusalem council affirms salvation by grace through faith alone.",
      "keyVerseRef": "Acts 15:11 (NKJV)",
      "keyVerseText": "But we believe that through the grace of the Lord Jesus Christ we shall be saved in the same manner as they."
    },
    {
      "id": "w18d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "May 7",
      "readings": "1 Sam 23–24; 1 Chr 6; Ps 54; Acts 16",
      "summary": "David spares Saul’s life, choosing mercy over revenge, trusting God to judge righteously. Psalm 54 cries to God for help. In Acts 16, Lydia and a jailer are saved, and the gospel reaches Europe.",
      "keyVerseRef": "1 Samuel 24:12 (NKJV)",
      "keyVerseText": "Let the LORD judge between you and me, and let the LORD avenge me on you. But my hand shall not be against you."
    },
    {
      "id": "w18d5",
      "dayOfWeek": "Friday",
      "dateLabel": "May 8",
      "readings": "1 Sam 25; 1 Chr 7; Acts 17",
      "summary": "David nearly takes vengeance, but Abigail intervenes with wisdom and grace. Chronicles continues Israel’s lineage. In Acts 17, Paul preaches in Athens and proclaims the one true God and risen King.",
      "keyVerseRef": "Acts 17:28 (NKJV)",
      "keyVerseText": "For in Him we live and move and have our being."
    }
  ]
},
{
  "weekNumber": 19,
  "weekLabel": "Week 19 — May 11–15",
  "days": [
    {
      "id": "w19d1",
      "dayOfWeek": "Monday",
      "dateLabel": "May 11",
      "readings": "1 Sam 26–27; 1 Chr 8; Acts 18",
      "summary": "David again spares Saul showing restraint and mercy. He seeks refuge in Philistine territory. Chronicles records Benjamin’s line. In Acts 18, Paul ministers in Corinth and God encourages him to keep speaking.",
      "keyVerseRef": "1 Samuel 26:23 (NKJV)",
      "keyVerseText": "May the LORD repay every man for his righteousness and his faithfulness."
    },
    {
      "id": "w19d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "May 12",
      "readings": "1 Sam 28–29; 1 Chr 9; Acts 19",
      "summary": "Saul turns to a medium in desperation instead of seeking the Lord. David’s future kingship approaches. Chronicles notes returning exiles. In Acts 19, revival and opposition rise as Christ transforms lives.",
      "keyVerseRef": "Acts 19:20 (NKJV)",
      "keyVerseText": "So the word of the Lord grew mightily and prevailed."
    },
    {
      "id": "w19d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "May 13",
      "readings": "1 Sam 30–31; 1 Chr 10; Acts 20",
      "summary": "David strengthens himself in the Lord, restores what was lost, and Saul’s tragic fall ends his reign. In Acts 20, Paul encourages the elders to shepherd God’s flock with vigilance and love.",
      "keyVerseRef": "1 Samuel 30:6 (NKJV)",
      "keyVerseText": "But David strengthened himself in the LORD his God."
    },
    {
      "id": "w19d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "May 14",
      "readings": "2 Sam 1–2; 1 Chr 11; Ps 96,106; Acts 21",
      "summary": "David laments Saul and Jonathan, honoring even a fallen king. He is anointed over Judah. Chronicles highlights David’s mighty men. Psalms praise God’s greatness and mercy. Acts 21 shows Paul’s costly obedience.",
      "keyVerseRef": "2 Samuel 1:23 (NKJV)",
      "keyVerseText": "Saul and Jonathan were beloved and pleasant in their lives, and in their death they were not divided."
    },
    {
      "id": "w19d5",
      "dayOfWeek": "Friday",
      "dateLabel": "May 15",
      "readings": "2 Sam 3–5; 1 Chr 12; Ps 122; Acts 22",
      "summary": "David becomes king over all Israel and conquers Jerusalem, establishing it as the city of David. Chronicles records loyal supporters. Psalm 122 prays for peace in Jerusalem. In Acts 22, Paul testifies boldly to Christ.",
      "keyVerseRef": "2 Samuel 5:10 (NKJV)",
      "keyVerseText": "So David went on and became great, and the LORD God of hosts was with him."
    }
  ]
},
{
  "weekNumber": 20,
  "weekLabel": "Week 20 — May 18–22",
  "days": [
    {
      "id": "w20d1",
      "dayOfWeek": "Monday",
      "dateLabel": "May 18",
      "readings": "2 Sam 6; 1 Chr 13; Ps 60; Acts 23",
      "summary": "The ark is brought toward Jerusalem and David worships with joy, though irreverence brings judgment. Chronicles mirrors the account. Psalm 60 cries for restoration. In Acts 23, God assures Paul he will witness in Rome.",
      "keyVerseRef": "2 Samuel 6:14 (NKJV)",
      "keyVerseText": "Then David danced before the LORD with all his might."
    },
    {
      "id": "w20d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "May 19",
      "readings": "1 Chr 14–16; Acts 24",
      "summary": "David grows in victory, brings the ark to Jerusalem properly, and appoints worship before the Lord continually. In Acts 24, Paul speaks before Felix with a clear conscience and hope in the resurrection.",
      "keyVerseRef": "1 Chronicles 16:34 (NKJV)",
      "keyVerseText": "Oh, give thanks to the LORD, for He is good! For His mercy endures forever."
    },
    {
      "id": "w20d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "May 20",
      "readings": "2 Sam 7–8; 1 Chr 17; Ps 132; Acts 25",
      "summary": "God makes an everlasting covenant with David promising a kingdom and a son who will reign forever. Chronicles reflects the same hope. Psalm 132 celebrates God’s choice of David. In Acts 25, Paul appeals to Caesar.",
      "keyVerseRef": "2 Samuel 7:16 (NKJV)",
      "keyVerseText": "And your house and your kingdom shall be established forever before you. Your throne shall be established forever."
    },
    {
      "id": "w20d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "May 21",
      "readings": "2 Sam 9–10; 1 Chr 18–19; Ps 89; Acts 26",
      "summary": "David shows kindness to Mephibosheth and wins victories by God’s help. Chronicles recounts the same victories. Psalm 89 praises God’s covenant love. In Acts 26, Paul tells King Agrippa the story of Jesus’ saving power.",
      "keyVerseRef": "Acts 26:29 (NKJV)",
      "keyVerseText": "\"I would to God that not only you, but also all who hear me today, might become both almost and altogether such as I am—except for these chains.\""
    },
    {
      "id": "w20d5",
      "dayOfWeek": "Friday",
      "dateLabel": "May 22",
      "readings": "2 Sam 11–12; 1 Chr 20; Ps 51,32; Acts 27",
      "summary": "David sins terribly with Bathsheba and kills her husband, yet when confronted he repents. Psalms 51 and 32 cry out in confession and joy of forgiveness. In Acts 27, God protects Paul through the storm at sea.",
      "keyVerseRef": "Psalm 51:10 (NKJV)",
      "keyVerseText": "Create in me a clean heart, O God, and renew a steadfast spirit within me."
    }
  ]
},
{
  "weekNumber": 21,
  "weekLabel": "Week 21 — May 25–29",
  "days": [
    {
      "id": "w21d1",
      "dayOfWeek": "Monday",
      "dateLabel": "May 25",
      "readings": "2 Sam 13–14; Acts 28",
      "summary": "David’s family suffers consequences of sin. Absalom returns from exile, yet tension remains unresolved. In Acts 28, Paul arrives in Rome, proclaiming Christ with boldness and without hindrance.",
      "keyVerseRef": "Acts 28:31 (NKJV)",
      "keyVerseText": "Preaching the kingdom of God and teaching the things which concern the Lord Jesus Christ with all confidence, no one forbidding him."
    },
    {
      "id": "w21d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "May 26",
      "readings": "2 Sam 15–17; Ps 3,63; Rom 1",
      "summary": "Absalom rebels and David flees, trusting God through betrayal. Psalms reflect confidence under pressure. In Romans 1, Paul begins unfolding the gospel, showing humanity’s need for salvation.",
      "keyVerseRef": "Psalm 3:3 (NKJV)",
      "keyVerseText": "But You, O LORD, are a shield for me, my glory and the One who lifts up my head."
    },
    {
      "id": "w21d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "May 27",
      "readings": "2 Sam 18–20; Ps 34; Rom 2",
      "summary": "Absalom dies and David mourns deeply. Restoration is difficult and incomplete. Psalm 34 praises God for deliverance. Romans 2 warns against hypocrisy, calling all to true, repentant faith.",
      "keyVerseRef": "Psalm 34:18 (NKJV)",
      "keyVerseText": "The LORD is near to those who have a broken heart, and saves such as have a contrite spirit."
    },
    {
      "id": "w21d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "May 28",
      "readings": "2 Sam 21–23; Ps 18; Rom 3",
      "summary": "God avenges injustice, David’s mighty men are honored, and his final song praises God’s rescue. Psalm 18 declares God our rock and fortress. Romans 3 reveals all have sinned and need God’s righteousness.",
      "keyVerseRef": "Romans 3:23 (NKJV)",
      "keyVerseText": "For all have sinned and fall short of the glory of God."
    },
    {
      "id": "w21d5",
      "dayOfWeek": "Friday",
      "dateLabel": "May 29",
      "readings": "2 Sam 24; 1 Chr 21; Rom 4",
      "summary": "David sins by numbering Israel yet chooses mercy from God, who relents after judgment. Chronicles parallels the account. Romans 4 highlights Abraham as our example of faith credited as righteousness.",
      "keyVerseRef": "Romans 4:3 (NKJV)",
      "keyVerseText": "Abraham believed God, and it was accounted to him for righteousness."
    }
  ]
},
{
  "weekNumber": 22,
  "weekLabel": "Week 22 — June 1–5",
  "days": [
    {
      "id": "w22d1",
      "dayOfWeek": "Monday",
      "dateLabel": "June 1",
      "readings": "1 Chr 22–25; Ps 78; Rom 5",
      "summary": "David prepares everything for the temple and organizes worship. Psalm 78 recalls God’s faithfulness across generations. Romans 5 celebrates justification by faith and the life we have through Christ.",
      "keyVerseRef": "Romans 5:8 (NKJV)",
      "keyVerseText": "But God demonstrates His own love toward us, in that while we were still sinners, Christ died for us."
    },
    {
      "id": "w22d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "June 2",
      "readings": "1 Kgs 1; 1 Chr 26–28; Rom 6",
      "summary": "Solomon is declared king and David charges leaders to serve faithfully. Romans 6 teaches that believers are dead to sin and alive to God through Christ.",
      "keyVerseRef": "Romans 6:4 (NKJV)",
      "keyVerseText": "Therefore we were buried with Him through baptism into death, that just as Christ was raised from the dead by the glory of the Father, even so we also should walk in newness of life."
    },
    {
      "id": "w22d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "June 3",
      "readings": "1 Kgs 2; 1 Chr 29; Rom 7",
      "summary": "David gives final instructions, Solomon secures his kingdom, and Israel rejoices in worship. Romans 7 reveals the struggle with sin and the need for deliverance through Christ.",
      "keyVerseRef": "Romans 7:24–25 (NKJV)",
      "keyVerseText": "O wretched man that I am! Who will deliver me from this body of death? I thank God—through Jesus Christ our Lord!"
    },
    {
      "id": "w22d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "June 4",
      "readings": "1 Kgs 3; 2 Chr 1; Ps 42; Rom 8",
      "summary": "Solomon asks for wisdom, and God grants it. Psalm 42 longs for God amid distress. Romans 8 proclaims no condemnation in Christ and victory through the Spirit.",
      "keyVerseRef": "Romans 8:1 (NKJV)",
      "keyVerseText": "There is therefore now no condemnation to those who are in Christ Jesus."
    },
    {
      "id": "w22d5",
      "dayOfWeek": "Friday",
      "dateLabel": "June 5",
      "readings": "1 Kgs 4; Prov 1–2; Ps 43; Rom 9",
      "summary": "Solomon’s wisdom spreads. Proverbs begins with the call to fear the LORD. Psalm 43 cries for vindication. Romans 9 reveals God’s sovereign mercy and calling.",
      "keyVerseRef": "Proverbs 1:7 (NKJV)",
      "keyVerseText": "The fear of the LORD is the beginning of knowledge, but fools despise wisdom and instruction."
    }
  ]
},
{
  "weekNumber": 23,
  "weekLabel": "Week 23 — June 8–12",
  "days": [
    {
      "id": "w23d1",
      "dayOfWeek": "Monday",
      "dateLabel": "June 8",
      "readings": "Prov 3–5; Rom 10",
      "summary": "Wisdom teaches trust in God, purity, and integrity. Romans 10 proclaims salvation through faith and confessing Christ openly.",
      "keyVerseRef": "Proverbs 3:5–6 (NKJV)",
      "keyVerseText": "Trust in the LORD with all your heart, and lean not on your own understanding; in all your ways acknowledge Him, and He shall direct your paths."
    },
    {
      "id": "w23d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "June 9",
      "readings": "Prov 6–7; Ps 7; Rom 11",
      "summary": "Warnings against adultery, laziness, and rebellious hearts. Psalm 7 appeals to God’s justice. Romans 11 shows God’s mercy to Jews and Gentiles alike.",
      "keyVerseRef": "Romans 11:36 (NKJV)",
      "keyVerseText": "For of Him and through Him and to Him are all things, to whom be glory forever. Amen."
    },
    {
      "id": "w23d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "June 10",
      "readings": "Prov 8–10; Ps 144; Rom 12",
      "summary": "Wisdom calls out offering life and blessing. Psalm 144 praises God our fortress. Romans 12 urges believers to live transformed lives of worship and love.",
      "keyVerseRef": "Romans 12:1 (NKJV)",
      "keyVerseText": "I beseech you therefore, brethren, by the mercies of God, that you present your bodies a living sacrifice, holy, acceptable to God, which is your reasonable service."
    },
    {
      "id": "w23d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "June 11",
      "readings": "Prov 11–13; Ps 8; Rom 13",
      "summary": "Proverbs teaches righteousness, humility, and wise speech. Psalm 8 marvels at God’s glory and care for humanity. Romans 13 calls believers to love and live uprightly.",
      "keyVerseRef": "Psalm 8:4 (NKJV)",
      "keyVerseText": "What is man that You are mindful of him, and the son of man that You visit him?"
    },
    {
      "id": "w23d5",
      "dayOfWeek": "Friday",
      "dateLabel": "June 12",
      "readings": "Prov 14–15; Rom 14",
      "summary": "The wise walk uprightly, speak carefully, and fear the LORD. Romans 14 teaches unity and grace in matters of conscience.",
      "keyVerseRef": "Proverbs 15:1 (NKJV)",
      "keyVerseText": "A soft answer turns away wrath, but a harsh word stirs up anger."
    }
  ]
},
{
  "weekNumber": 24,
  "weekLabel": "Week 24 — June 15–19",
  "days": [
    {
      "id": "w24d1",
      "dayOfWeek": "Monday",
      "dateLabel": "June 15",
      "readings": "Prov 16–18; Rom 15",
      "summary": "Proverbs teaches humility, integrity, and the power of words. Romans 15 calls believers to unity, hope, and encouragement through Scripture.",
      "keyVerseRef": "Proverbs 16:3 (NKJV)",
      "keyVerseText": "Commit your works to the LORD, and your thoughts will be established."
    },
    {
      "id": "w24d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "June 16",
      "readings": "Prov 19–21; Ps 40; Rom 16",
      "summary": "Wisdom calls for patience, justice, and dependence on God. Psalm 40 praises His deliverance. Romans 16 honors faithful servants in Christ’s mission.",
      "keyVerseRef": "Psalm 40:1 (NKJV)",
      "keyVerseText": "I waited patiently for the LORD; and He inclined to me, and heard my cry."
    },
    {
      "id": "w24d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "June 17",
      "readings": "Prov 22–23; Ps 117; 1 Thess 1",
      "summary": "Wisdom teaches on parenting, purity, generosity, and discipline. Psalm 117 calls all nations to praise. 1 Thessalonians 1 celebrates faith that spreads like fire.",
      "keyVerseRef": "1 Thessalonians 1:5 (NKJV)",
      "keyVerseText": "For our gospel did not come to you in word only, but also in power, and in the Holy Spirit and in much assurance."
    },
    {
      "id": "w24d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "June 18",
      "readings": "Prov 24–25; Ps 41; 1 Thess 2",
      "summary": "Wisdom teaches perseverance, compassion, and kindness even to enemies. Psalm 41 blesses those who consider the poor. 1 Thessalonians 2 reflects a leader’s loving heart.",
      "keyVerseRef": "1 Thessalonians 2:8 (NKJV)",
      "keyVerseText": "So, affectionately longing for you, we were well pleased to impart to you not only the gospel of God, but also our own lives, because you had become dear to us."
    },
    {
      "id": "w24d5",
      "dayOfWeek": "Friday",
      "dateLabel": "June 19",
      "readings": "Prov 26–28; 1 Thess 3",
      "summary": "Warnings against folly and pride, calls to diligence and righteousness. Paul prays for believers to abound in love and holiness.",
      "keyVerseRef": "1 Thessalonians 3:12 (NKJV)",
      "keyVerseText": "And may the Lord make you increase and abound in love to one another and to all."
    }
  ]
},
{
  "weekNumber": 25,
  "weekLabel": "Week 25 — June 22–26",
  "days": [
    {
      "id": "w25d1",
      "dayOfWeek": "Monday",
      "dateLabel": "June 22",
      "readings": "Prov 29–31; 1 Thess 4",
      "summary": "Wisdom calls for discipline, justice, purity, and godly womanhood. In 1 Thessalonians 4, believers are called to holiness and hope in Christ’s return.",
      "keyVerseRef": "1 Thessalonians 4:16–17 (NKJV)",
      "keyVerseText": "For the Lord Himself will descend from heaven with a shout… and thus we shall always be with the Lord."
    },
    {
      "id": "w25d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "June 23",
      "readings": "Song 1–3; Ps 72; 1 Thess 5",
      "summary": "Song of Solomon celebrates covenant love and intimacy. Psalm 72 praises God’s righteous King. In 1 Thessalonians 5, believers are urged to rejoice, pray, and give thanks always.",
      "keyVerseRef": "1 Thessalonians 5:16–18 (NKJV)",
      "keyVerseText": "Rejoice always, pray without ceasing, in everything give thanks."
    },
    {
      "id": "w25d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "June 24",
      "readings": "Song 4–6; 2 Thess 1",
      "summary": "Love is celebrated with delight and devotion. In 2 Thessalonians 1, God strengthens His children and promises justice for the oppressed.",
      "keyVerseRef": "2 Thessalonians 1:7 (NKJV)",
      "keyVerseText": "And to give you who are troubled rest with us when the Lord Jesus is revealed from heaven with His mighty angels."
    },
    {
      "id": "w25d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "June 25",
      "readings": "Song 7–8; Ps 127; 2 Thess 2",
      "summary": "Love’s endurance and covenant strength shine. Psalm 127 declares God as builder and protector. In 2 Thessalonians 2, believers hold fast to truth as deception rises.",
      "keyVerseRef": "Psalm 127:1 (NKJV)",
      "keyVerseText": "Unless the LORD builds the house, they labor in vain who build it."
    },
    {
      "id": "w25d5",
      "dayOfWeek": "Friday",
      "dateLabel": "June 26",
      "readings": "1 Kgs 5; 2 Chr 2; 2 Thess 3",
      "summary": "Solomon prepares to build God’s temple with excellence. In 2 Thessalonians 3, believers are urged to work diligently and not grow weary in doing good.",
      "keyVerseRef": "2 Thessalonians 3:13 (NKJV)",
      "keyVerseText": "But as for you, brethren, do not grow weary in doing good."
    }
  ]
},
{
  "weekNumber": 26,
  "weekLabel": "Week 26 — June 29–July 3",
  "days": [
    {
      "id": "w26d1",
      "dayOfWeek": "Monday",
      "dateLabel": "June 29",
      "readings": "1 Kgs 6; 2 Chr 3; 1 Tim 1",
      "summary": "Solomon builds the temple with beauty and devotion. In 1 Timothy 1, Paul charges believers to hold to sound doctrine and sincere faith.",
      "keyVerseRef": "1 Timothy 1:5 (NKJV)",
      "keyVerseText": "Now the purpose of the commandment is love from a pure heart, from a good conscience, and from sincere faith."
    },
    {
      "id": "w26d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "June 30",
      "readings": "1 Kgs 7; 2 Chr 4; Ps 44; 1 Tim 2",
      "summary": "Temple furnishings display glory and craftsmanship. Psalm 44 remembers God’s works. In 1 Timothy 2, believers are called to prayer and godliness.",
      "keyVerseRef": "1 Timothy 2:5 (NKJV)",
      "keyVerseText": "For there is one God and one Mediator between God and men, the Man Christ Jesus."
    },
    {
      "id": "w26d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "July 1",
      "readings": "1 Kgs 8; Ps 30; 1 Tim 3",
      "summary": "The temple is dedicated and God’s presence fills it with glory. Psalm 30 gives thanks for deliverance. 1 Timothy 3 outlines godly leadership.",
      "keyVerseRef": "1 Kings 8:27 (NKJV)",
      "keyVerseText": "But will God indeed dwell on the earth? Behold, heaven and the heaven of heavens cannot contain You."
    },
    {
      "id": "w26d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "July 2",
      "readings": "2 Chr 5–7; Ps 121; 1 Tim 4",
      "summary": "The temple is filled with God’s glory, and Solomon prays for mercy, revival, and blessing. Psalm 121 declares God as our keeper. 1 Timothy 4 urges believers to train in godliness.",
      "keyVerseRef": "2 Chronicles 7:14 (NKJV)",
      "keyVerseText": "If My people who are called by My name will humble themselves, and pray and seek My face… then I will hear from heaven."
    },
    {
      "id": "w26d5",
      "dayOfWeek": "Friday",
      "dateLabel": "July 3",
      "readings": "1 Kgs 9; 2 Chr 8; 1 Tim 5",
      "summary": "Solomon builds and strengthens the kingdom but later drifts from full devotion. In 1 Timothy 5, the church is called to honor widows and shepherd well.",
      "keyVerseRef": "1 Timothy 5:8 (NKJV)",
      "keyVerseText": "If anyone does not provide for his own… he has denied the faith and is worse than an unbeliever."
    }
  ]
},
{
  "weekNumber": 27,
  "weekLabel": "Week 27 — July 6–10",
  "days": [
    {
      "id": "w27d1",
      "dayOfWeek": "Monday",
      "dateLabel": "July 6",
      "readings": "1 Kgs 10–11; 2 Chr 9; 1 Tim 6",
      "summary": "Solomon reaches peak wealth and wisdom but later turns to idols. In 1 Timothy 6, believers are urged to pursue godliness over riches.",
      "keyVerseRef": "1 Timothy 6:6 (NKJV)",
      "keyVerseText": "Now godliness with contentment is great gain."
    },
    {
      "id": "w27d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "July 7",
      "readings": "Eccl 1–3; Ps 45; 2 Tim 1",
      "summary": "Solomon reflects on life’s vanity apart from God. Psalm 45 celebrates the royal bridegroom-king. In 2 Timothy 1, Timothy is urged to fan the flame of bold faith.",
      "keyVerseRef": "2 Timothy 1:7 (NKJV)",
      "keyVerseText": "For God has not given us a spirit of fear, but of power and of love and of a sound mind."
    },
    {
      "id": "w27d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "July 8",
      "readings": "Eccl 4–6; Ps 125; 2 Tim 2",
      "summary": "Life on earth is short, fragile, and empty without God. Psalm 125 celebrates security in the Lord. In 2 Timothy 2, we endure hardship as faithful servants of Christ.",
      "keyVerseRef": "Ecclesiastes 5:2 (NKJV)",
      "keyVerseText": "God is in heaven, and you on earth; therefore let your words be few."
    },
    {
      "id": "w27d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "July 9",
      "readings": "Eccl 7–9; Ps 46; 2 Tim 3",
      "summary": "Wisdom teaches humility, the certainty of death, and the value of righteousness. Psalm 46 proclaims God as refuge. 2 Timothy 3 warns of last-day deception and calls us to Scripture.",
      "keyVerseRef": "2 Timothy 3:16–17 (NKJV)",
      "keyVerseText": "All Scripture is given by inspiration of God… that the man of God may be complete."
    },
    {
      "id": "w27d5",
      "dayOfWeek": "Friday",
      "dateLabel": "July 10",
      "readings": "Eccl 10–12; 2 Tim 4",
      "summary": "Life’s meaning is found in fearing God and keeping His commandments. In 2 Timothy 4, Paul finishes strong and urges us to do the same.",
      "keyVerseRef": "Ecclesiastes 12:13 (NKJV)",
      "keyVerseText": "Fear God and keep His commandments, for this is man’s all."
    }
  ]
},
{
  "weekNumber": 28,
  "weekLabel": "Week 28 — July 13–17",
  "days": [
    {
      "id": "w28d1",
      "dayOfWeek": "Monday",
      "dateLabel": "July 13",
      "readings": "1 Kgs 12; 2 Chr 10–11; Titus 1",
      "summary": "The kingdom divides—Judah and Israel separate. Chronicles highlights Rehoboam’s early obedience. Titus 1 calls leaders to sound doctrine and integrity.",
      "keyVerseRef": "Titus 1:9 (NKJV)",
      "keyVerseText": "Holding fast the faithful word as he has been taught."
    },
    {
      "id": "w28d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "July 14",
      "readings": "1 Kgs 13–14; 2 Chr 12; Ps 47; Titus 2",
      "summary": "Judgment comes for disobedience and idolatry. Psalm 47 exalts the King over all nations. Titus 2 teaches godly living centered in grace.",
      "keyVerseRef": "Titus 2:11–12 (NKJV)",
      "keyVerseText": "For the grace of God… teaches us that we should live soberly, righteously, and godly."
    },
    {
      "id": "w28d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "July 15",
      "readings": "1 Kgs 15; 2 Chr 13–14; Titus 3",
      "summary": "Some kings walk with God, others in sin—but God remains faithful. Titus 3 reminds us of salvation by mercy, not works.",
      "keyVerseRef": "Titus 3:5 (NKJV)",
      "keyVerseText": "Not by works of righteousness which we have done, but according to His mercy He saved us."
    },
    {
      "id": "w28d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "July 16",
      "readings": "2 Chr 15–16; 1 Kgs 16; Philemon",
      "summary": "Revival comes under Asa, but later he trusts man over God. Philemon urges forgiveness and reconciliation in Christ.",
      "keyVerseRef": "Philemon 1:6 (NKJV)",
      "keyVerseText": "That the sharing of your faith may become effective."
    },
    {
      "id": "w28d5",
      "dayOfWeek": "Friday",
      "dateLabel": "July 17",
      "readings": "1 Kgs 17–18; Ps 119; Jude",
      "summary": "Elijah stands boldly against idolatry and God sends fire on Carmel. Psalm 119 treasures God's Word. Jude calls believers to contend for the faith.",
      "keyVerseRef": "1 Kings 18:21 (NKJV)",
      "keyVerseText": "How long will you falter between two opinions? If the LORD is God, follow Him."
    }
  ]
},
{
  "weekNumber": 29,
  "weekLabel": "Week 29 — July 20–24",
  "days": [
    {
      "id": "w29d1",
      "dayOfWeek": "Monday",
      "dateLabel": "July 20",
      "readings": "1 Kgs 19–21; 2 Chr 17; Ps 129; Matt 1",
      "summary": "Elijah flees but God restores him with presence and purpose. Jehoshaphat strengthens Judah. Psalm 129 declares God’s deliverance. Matthew opens with Christ’s genealogy and birth.",
      "keyVerseRef": "Matthew 1:21 (NKJV)",
      "keyVerseText": "And she will bring forth a Son, and you shall call His name JESUS, for He will save His people from their sins."
    },
    {
      "id": "w29d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "July 21",
      "readings": "1 Kgs 22; 2 Chr 18; Matt 2",
      "summary": "Ahab falls despite warning, revealing the danger of rejecting truth. Wise men worship Jesus as newborn King and God protects Him from Herod.",
      "keyVerseRef": "Matthew 2:11 (NKJV)",
      "keyVerseText": "And they fell down and worshiped Him."
    },
    {
      "id": "w29d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "July 22",
      "readings": "2 Chr 19–20; 2 Kgs 1; Ps 20; Matt 3",
      "summary": "Jehoshaphat seeks God in crisis and sees deliverance without fighting. Psalm 20 trusts in the name of the LORD. John baptizes Jesus, heaven opens, and the Father affirms His Son.",
      "keyVerseRef": "2 Chronicles 20:15 (NKJV)",
      "keyVerseText": "The battle is not yours, but God's."
    },
    {
      "id": "w29d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "July 23",
      "readings": "2 Kgs 2–3; Ps 48; Matt 4",
      "summary": "Elijah is taken up and Elisha receives a double portion. God supplies water miraculously. Psalm 48 praises God’s steadfast presence. Jesus overcomes temptation with Scripture.",
      "keyVerseRef": "Matthew 4:4 (NKJV)",
      "keyVerseText": "Man shall not live by bread alone, but by every word that proceeds from the mouth of God."
    },
    {
      "id": "w29d5",
      "dayOfWeek": "Friday",
      "dateLabel": "July 24",
      "readings": "2 Kgs 4–6; Matt 5",
      "summary": "Elisha performs miracles of provision, healing, and deliverance. Jesus delivers the Sermon on the Mount, calling His followers to a kingdom way of life.",
      "keyVerseRef": "Matthew 5:16 (NKJV)",
      "keyVerseText": "Let your light so shine before men, that they may see your good works and glorify your Father in heaven."
    }
  ]
},
{
  "weekNumber": 30,
  "weekLabel": "Week 30 — July 27–31",
  "days": [
    {
      "id": "w30d1",
      "dayOfWeek": "Monday",
      "dateLabel": "July 27",
      "readings": "2 Kgs 7–8; 2 Chr 21; Matt 6",
      "summary": "God miraculously ends famine and preserves His people. Judah faces judgment for unfaithful leadership. Jesus teaches about prayer, giving, fasting, and eternal treasure.",
      "keyVerseRef": "Matthew 6:33 (NKJV)",
      "keyVerseText": "But seek first the kingdom of God and His righteousness, and all these things shall be added to you."
    },
    {
      "id": "w30d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "July 28",
      "readings": "2 Kgs 9–10; Ps 49; Matt 7",
      "summary": "Jehu executes judgment on Ahab’s house and Baal worship. Psalm 49 reminds us riches cannot save. Jesus warns to build life on obedience to His words.",
      "keyVerseRef": "Matthew 7:24 (NKJV)",
      "keyVerseText": "Whoever hears these sayings of Mine, and does them, I will liken him to a wise man who built his house on the rock."
    },
    {
      "id": "w30d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "July 29",
      "readings": "2 Chr 22–23; 2 Kgs 11; Ps 131; Matt 8",
      "summary": "Athaliah seizes power but God preserves David’s line through Joash. Psalm 131 rests in God like a child. Jesus heals the sick and calms the storm.",
      "keyVerseRef": "Matthew 8:27 (NKJV)",
      "keyVerseText": "Even the winds and the sea obey Him!"
    },
    {
      "id": "w30d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "July 30",
      "readings": "2 Chr 24; 2 Kgs 12; Ps 50; Matt 9",
      "summary": "Joash restores the temple but later abandons God. Psalm 50 calls for true worship. Jesus heals, forgives sins, and sends workers into the harvest.",
      "keyVerseRef": "Matthew 9:37–38 (NKJV)",
      "keyVerseText": "The harvest truly is plentiful, but the laborers are few."
    },
    {
      "id": "w30d5",
      "dayOfWeek": "Friday",
      "dateLabel": "July 31",
      "readings": "Joel 1–3; Matt 10",
      "summary": "Joel calls for repentance and promises outpouring of the Spirit. Jesus sends His disciples to proclaim the kingdom with power.",
      "keyVerseRef": "Joel 2:28 (NKJV)",
      "keyVerseText": "I will pour out My Spirit on all flesh..."
    }
  ]
},
{
  "weekNumber": 31,
  "weekLabel": "Week 31 — August 3–7",
  "days": [
    {
      "id": "w31d1",
      "dayOfWeek": "Monday",
      "dateLabel": "August 3",
      "readings": "Jonah 1–4; Matt 11",
      "summary": "Jonah runs but God pursues both him and Nineveh with mercy. Jesus invites the weary to rest in Him.",
      "keyVerseRef": "Matthew 11:28 (NKJV)",
      "keyVerseText": "Come to Me, all you who labor and are heavy laden, and I will give you rest."
    },
    {
      "id": "w31d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "August 4",
      "readings": "2 Kgs 13–14; 2 Chr 25; Ps 53; Matt 12",
      "summary": "Kings rise and fall but God still rescues and restores. Psalm 53 exposes human sin. Jesus is Lord of the Sabbath and greater than the temple.",
      "keyVerseRef": "Matthew 12:8 (NKJV)",
      "keyVerseText": "For the Son of Man is Lord even of the Sabbath."
    },
    {
      "id": "w31d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "August 5",
      "readings": "Amos 1–3; Matt 13",
      "summary": "God calls nations and Israel to account for injustice and idolatry. Jesus teaches kingdom parables revealing hearts and harvest.",
      "keyVerseRef": "Matthew 13:44 (NKJV)",
      "keyVerseText": "The kingdom of heaven is like treasure hidden in a field..."
    },
    {
      "id": "w31d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "August 6",
      "readings": "Amos 4–6; Ps 55; Matt 14",
      "summary": "God warns the complacent and calls for heart repentance. Psalm 55 cries out under betrayal. Jesus feeds five thousand and walks on water.",
      "keyVerseRef": "Matthew 14:27 (NKJV)",
      "keyVerseText": "Be of good cheer! It is I; do not be afraid."
    },
    {
      "id": "w31d5",
      "dayOfWeek": "Friday",
      "dateLabel": "August 7",
      "readings": "Amos 7–9; Matt 15",
      "summary": "God warns through visions yet promises restoration. Jesus confronts tradition and heals persistent faith.",
      "keyVerseRef": "Matthew 15:28 (NKJV)",
      "keyVerseText": "O woman, great is your faith! Let it be to you as you desire."
    }
  ]
},
{
  "weekNumber": 32,
  "weekLabel": "Week 32 — August 10–14",
  "days": [
    {
      "id": "w32d1",
      "dayOfWeek": "Monday",
      "dateLabel": "August 10",
      "readings": "Hos 1–3; Matt 16",
      "summary": "Hosea’s marriage pictures God’s faithful love for unfaithful Israel. Jesus asks, “Who do you say I am?” — the most defining question of all time.",
      "keyVerseRef": "Matthew 16:16 (NKJV)",
      "keyVerseText": "You are the Christ, the Son of the living God."
    },
    {
      "id": "w32d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "August 11",
      "readings": "Hos 4–6; Ps 58; Matt 17",
      "summary": "God desires mercy, not ritual; love that returns to Him. Psalm 58 cries for justice. Jesus is transfigured in glory as the beloved Son.",
      "keyVerseRef": "Hosea 6:6 (NKJV)",
      "keyVerseText": "For I desire mercy and not sacrifice, and the knowledge of God more than burnt offerings."
    },
    {
      "id": "w32d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "August 12",
      "readings": "Hos 7–10; Matt 18",
      "summary": "Israel turns to idols and foreign power instead of God. Jesus teaches forgiveness without limit and seeks the lost sheep.",
      "keyVerseRef": "Matthew 18:12 (NKJV)",
      "keyVerseText": "If a man has a hundred sheep, and one of them goes astray... does he not go to the mountains to seek the one that is straying?"
    },
    {
      "id": "w32d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "August 13",
      "readings": "Hos 11–13; Matt 19",
      "summary": "God’s love mourns rebellion but promises redemption. Jesus teaches about marriage, riches, and childlike faith.",
      "keyVerseRef": "Matthew 19:26 (NKJV)",
      "keyVerseText": "With God all things are possible."
    },
    {
      "id": "w32d5",
      "dayOfWeek": "Friday",
      "dateLabel": "August 14",
      "readings": "Hos 14; 2 Chr 26–27; Ps 61; Matt 20",
      "summary": "Israel is called to return and flourish under God. Psalm 61 trusts God as refuge. Matthew 20 teaches servant leadership like Jesus.",
      "keyVerseRef": "Hosea 14:4 (NKJV)",
      "keyVerseText": "I will heal their backsliding, I will love them freely."
    }
  ]
},
{
  "weekNumber": 33,
  "weekLabel": "Week 33 — August 17–21",
  "days": [
    {
      "id": "w33d1",
      "dayOfWeek": "Monday",
      "dateLabel": "August 17",
      "readings": "2 Kgs 15–16; Matt 21",
      "summary": "Kings rise and fall with mixed devotion. Jesus enters Jerusalem as Messiah and cleanses the temple, calling for true worship.",
      "keyVerseRef": "Matthew 21:9 (NKJV)",
      "keyVerseText": "Hosanna to the Son of David! Blessed is He who comes in the name of the Lord!"
    },
    {
      "id": "w33d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "August 18",
      "readings": "Isa 1–3; Ps 9; Matt 22",
      "summary": "Isaiah rebukes empty worship and calls Israel to repentance. Psalm 9 praises God's justice. Jesus teaches of love, resurrection, and kingdom living.",
      "keyVerseRef": "Isaiah 1:18 (NKJV)",
      "keyVerseText": "Though your sins are like scarlet, they shall be as white as snow."
    },
    {
      "id": "w33d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "August 19",
      "readings": "Isa 4–6; Matt 23",
      "summary": "Isaiah sees God’s holiness and is cleansed for mission. Jesus rebukes hypocrisy and calls for true righteousness.",
      "keyVerseRef": "Isaiah 6:8 (NKJV)",
      "keyVerseText": "Here am I! Send me."
    },
    {
      "id": "w33d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "August 20",
      "readings": "Mic 1–4; Ps 10; Matt 24",
      "summary": "Micah warns of judgment yet promises Messiah’s kingdom. Psalm 10 longs for justice. Jesus teaches on signs of His return and endurance.",
      "keyVerseRef": "Micah 4:5 (NKJV)",
      "keyVerseText": "We will walk in the name of the LORD our God forever and ever."
    },
    {
      "id": "w33d5",
      "dayOfWeek": "Friday",
      "dateLabel": "August 21",
      "readings": "Mic 5–7; Matt 25",
      "summary": "The ruler from Bethlehem is promised — a shepherd king. Jesus teaches readiness through parables of stewardship and compassion.",
      "keyVerseRef": "Micah 6:8 (NKJV)",
      "keyVerseText": "What does the LORD require of you but to do justly, to love mercy, and to walk humbly with your God?"
    }
  ]
},
{
  "weekNumber": 34,
  "weekLabel": "Week 34 — August 24–28",
  "days": [
    {
      "id": "w34d1",
      "dayOfWeek": "Monday",
      "dateLabel": "August 24",
      "readings": "Isa 7–10; Ps 22; Matt 26",
      "summary": "A child called Immanuel is promised. Judah wavers between fear and faith. Psalm 22 foreshadows Christ’s crucifixion. Jesus prays in Gethsemane and is betrayed.",
      "keyVerseRef": "Isaiah 9:6 (NKJV)",
      "keyVerseText": "For unto us a Child is born… and His name will be called Wonderful, Counselor, Mighty God."
    },
    {
      "id": "w34d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "August 25",
      "readings": "Isa 11–13; Ps 118; Matt 27",
      "summary": "A righteous Branch from Jesse will rule in peace. Psalm 118 rejoices in God’s salvation. Jesus is condemned and crucified to redeem humanity.",
      "keyVerseRef": "Matthew 27:54 (NKJV)",
      "keyVerseText": "Truly this was the Son of God!"
    },
    {
      "id": "w34d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "August 26",
      "readings": "Isa 14–16; Matt 28",
      "summary": "God judges proud nations but restores His people. Jesus rises from the dead, commissioning disciples to reach the world.",
      "keyVerseRef": "Matthew 28:19–20 (NKJV)",
      "keyVerseText": "Go therefore and make disciples of all the nations… and lo, I am with you always."
    },
    {
      "id": "w34d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "August 27",
      "readings": "Isa 17–19; Ps 62; 1 Cor 1",
      "summary": "Nations fall, but God’s kingdom stands. Psalm 62 rests in God alone. Paul preaches Christ crucified as the power of God.",
      "keyVerseRef": "1 Corinthians 1:18 (NKJV)",
      "keyVerseText": "The message of the cross is foolishness to those who are perishing, but to us… it is the power of God."
    },
    {
      "id": "w34d5",
      "dayOfWeek": "Friday",
      "dateLabel": "August 28",
      "readings": "Isa 20–22; 1 Cor 2",
      "summary": "God exposes false confidence and calls for humility. Paul proclaims wisdom revealed by the Spirit through Christ.",
      "keyVerseRef": "1 Corinthians 2:2 (NKJV)",
      "keyVerseText": "For I determined not to know anything among you except Jesus Christ and Him crucified."
    }
  ]
},
{
  "weekNumber": 35,
  "weekLabel": "Week 35 — August 31–September 4",
  "days": [
    {
      "id": "w35d1",
      "dayOfWeek": "Monday",
      "dateLabel": "August 31",
      "readings": "Isa 23–25; 1 Cor 3",
      "summary": "God humbles nations but prepares a banquet of salvation on His holy mountain. Paul lays Christ as the only foundation for believers.",
      "keyVerseRef": "Isaiah 25:8 (NKJV)",
      "keyVerseText": "He will swallow up death forever."
    },
    {
      "id": "w35d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "September 1",
      "readings": "Isa 26–29; Ps 65; 1 Cor 4",
      "summary": "God keeps in perfect peace those who trust Him. Psalm 65 praises God for abundance. Paul teaches humility and faithfulness in stewardship.",
      "keyVerseRef": "Isaiah 26:3 (NKJV)",
      "keyVerseText": "You will keep him in perfect peace, whose mind is stayed on You."
    },
    {
      "id": "w35d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "September 2",
      "readings": "Isa 30–32; 1 Cor 5",
      "summary": "Judah seeks Egypt for help instead of God, yet He promises a coming King and righteousness restored. Paul calls for holiness in the church.",
      "keyVerseRef": "Isaiah 30:15 (NKJV)",
      "keyVerseText": "In returning and rest you shall be saved; in quietness and confidence shall be your strength."
    },
    {
      "id": "w35d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "September 3",
      "readings": "Isa 33–35; 1 Cor 6",
      "summary": "God brings judgment and redemption — sorrow will flee and joy will come. Paul calls believers to flee immorality and honor God with their bodies.",
      "keyVerseRef": "Isaiah 35:10 (NKJV)",
      "keyVerseText": "Everlasting joy shall be upon their heads."
    },
    {
      "id": "w35d5",
      "dayOfWeek": "Friday",
      "dateLabel": "September 4",
      "readings": "2 Chr 28; 2 Kgs 17; Ps 66; 1 Cor 7",
      "summary": "Israel falls into captivity for persistent sin. Psalm 66 praises God’s mighty works. Paul gives wisdom for marriage, calling believers to devotion to the Lord.",
      "keyVerseRef": "Psalm 66:20 (NKJV)",
      "keyVerseText": "Blessed be God, who has not turned away my prayer."
    }
  ]
},
{
  "weekNumber": 36,
  "weekLabel": "Week 36 — September 7–11",
  "days": [
    {
      "id": "w36d1",
      "dayOfWeek": "Monday",
      "dateLabel": "September 7",
      "readings": "2 Chr 29–31; 1 Cor 8",
      "summary": "Hezekiah restores worship and cleanses the temple with zeal. Paul teaches that knowledge must be governed by love.",
      "keyVerseRef": "2 Chronicles 29:36 (NKJV)",
      "keyVerseText": "Hezekiah rejoiced, and all the people — because God had prepared the people."
    },
    {
      "id": "w36d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "September 8",
      "readings": "2 Kgs 18–19; 2 Chr 32; Ps 67; 1 Cor 9",
      "summary": "Sennacherib threatens Jerusalem but God defends His people miraculously. Psalm 67 calls nations to praise God. Paul lays down rights for the sake of the gospel.",
      "keyVerseRef": "2 Kings 19:19 (NKJV)",
      "keyVerseText": "That all the kingdoms of the earth may know that You are the LORD God."
    },
    {
      "id": "w36d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "September 9",
      "readings": "Isa 36–37; Ps 123; 1 Cor 10",
      "summary": "Hezekiah prays in crisis and God delivers powerfully. Psalm 123 looks to God for mercy. Paul calls believers to flee idolatry and live for His glory.",
      "keyVerseRef": "1 Corinthians 10:31 (NKJV)",
      "keyVerseText": "Whether you eat or drink, or whatever you do, do all to the glory of God."
    },
    {
      "id": "w36d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "September 10",
      "readings": "2 Kgs 20; Isa 38–40; Ps 68; 1 Cor 11",
      "summary": "Hezekiah experiences healing and pride lessons. Isaiah proclaims comfort — God strengthens the weary. Paul teaches reverence in worship and communion.",
      "keyVerseRef": "Isaiah 40:31 (NKJV)",
      "keyVerseText": "Those who wait on the LORD shall renew their strength."
    },
    {
      "id": "w36d5",
      "dayOfWeek": "Friday",
      "dateLabel": "September 11",
      "readings": "Isa 41–44; 1 Cor 12",
      "summary": "God alone is Savior and Creator — idols cannot compare. Paul describes spiritual gifts and unity in the body of Christ.",
      "keyVerseRef": "Isaiah 41:10 (NKJV)",
      "keyVerseText": "Fear not, for I am with you; be not dismayed, for I am your God."
    }
  ]
},
{
  "weekNumber": 37,
  "weekLabel": "Week 37 — September 14–18",
  "days": [
    {
      "id": "w37d1",
      "dayOfWeek": "Monday",
      "dateLabel": "September 14",
      "readings": "Isa 45–48; 1 Cor 13",
      "summary": "God declares Cyrus His servant to free His people. Idols cannot save — only the Lord. Paul describes love as the greatest virtue.",
      "keyVerseRef": "1 Corinthians 13:13 (NKJV)",
      "keyVerseText": "And now abide faith, hope, love, these three; but the greatest of these is love."
    },
    {
      "id": "w37d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "September 15",
      "readings": "Isa 49–52; Ps 69; 1 Cor 14",
      "summary": "God’s Servant brings salvation to the nations. Psalm 69 cries out amid suffering. Paul instructs the church in orderly worship with love as the aim.",
      "keyVerseRef": "Isaiah 49:6 (NKJV)",
      "keyVerseText": "I will also give You as a light to the Gentiles, that You should be My salvation to the ends of the earth."
    },
    {
      "id": "w37d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "September 16",
      "readings": "Isa 53–55; Ps 128; 1 Cor 15",
      "summary": "The Suffering Servant bears our sins and brings healing. God offers free grace and everlasting covenant. Paul celebrates Christ’s resurrection victory.",
      "keyVerseRef": "Isaiah 53:5 (NKJV)",
      "keyVerseText": "He was wounded for our transgressions… and by His stripes we are healed."
    },
    {
      "id": "w37d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "September 17",
      "readings": "Isa 56–59; Ps 70; 1 Cor 16",
      "summary": "God calls His people to justice, prayer, and Sabbath joy. Sin separates, but the Redeemer comes to rescue. Paul ends with love and steadfastness in Christ.",
      "keyVerseRef": "Isaiah 59:1 (NKJV)",
      "keyVerseText": "Behold, the LORD’s hand is not shortened, that it cannot save."
    },
    {
      "id": "w37d5",
      "dayOfWeek": "Friday",
      "dateLabel": "September 18",
      "readings": "Isa 60–63; 2 Cor 1",
      "summary": "Future glory shines for God’s people. Jesus proclaims good news to the poor. God comforts and establishes believers by His Spirit.",
      "keyVerseRef": "Isaiah 60:1 (NKJV)",
      "keyVerseText": "Arise, shine; for your light has come!"
    }
  ]
},
{
  "weekNumber": 38,
  "weekLabel": "Week 38 — September 21–25",
  "days": [
    {
      "id": "w38d1",
      "dayOfWeek": "Monday",
      "dateLabel": "September 21",
      "readings": "Isa 64–66; 2 Cor 2",
      "summary": "Israel pleads for God to come down in power. God promises new heavens and a new earth. Paul calls believers to forgiveness and restored unity.",
      "keyVerseRef": "Isaiah 64:8 (NKJV)",
      "keyVerseText": "O LORD, You are our Father; we are the clay, and You our potter."
    },
    {
      "id": "w38d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "September 22",
      "readings": "2 Kgs 21; 2 Chr 33; Ps 71; 2 Cor 3",
      "summary": "Manasseh’s evil leads Judah astray, yet repentance brings mercy. Psalm 71 trusts God through every season. The Spirit brings new covenant freedom.",
      "keyVerseRef": "2 Corinthians 3:17 (NKJV)",
      "keyVerseText": "Where the Spirit of the Lord is, there is liberty."
    },
    {
      "id": "w38d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "September 23",
      "readings": "Nahum 1–3; Ps 149; 2 Cor 4",
      "summary": "God brings justice against Nineveh yet protects those who trust Him. Psalm 149 praises His victory. Paul renews hope in eternal glory.",
      "keyVerseRef": "Nahum 1:7 (NKJV)",
      "keyVerseText": "The LORD is good, a stronghold in the day of trouble."
    },
    {
      "id": "w38d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "September 24",
      "readings": "2 Kgs 22–23; Ps 73; 2 Cor 5",
      "summary": "Josiah restores Scripture and renews covenant worship. Psalm 73 finds refuge in God. Paul teaches reconciliation — we are new creations in Christ.",
      "keyVerseRef": "2 Corinthians 5:17 (NKJV)",
      "keyVerseText": "If anyone is in Christ, he is a new creation."
    },
    {
      "id": "w38d5",
      "dayOfWeek": "Friday",
      "dateLabel": "September 25",
      "readings": "2 Chr 34–35; 2 Cor 6",
      "summary": "Josiah leads revival through obedience to God’s Word. Paul calls believers to holiness and faithful perseverance in ministry.",
      "keyVerseRef": "2 Chronicles 34:31 (NKJV)",
      "keyVerseText": "The king stood and made a covenant before the LORD."
    }
  ]
},
{
  "weekNumber": 39,
  "weekLabel": "Week 39 — September 28–October 2",
  "days": [
    {
      "id": "w39d1",
      "dayOfWeek": "Monday",
      "dateLabel": "September 28",
      "readings": "Hab 1–3; 2 Cor 7",
      "summary": "Habakkuk wrestles with injustice but learns to trust God’s sovereignty. Joy and faith triumph even when circumstances fail.",
      "keyVerseRef": "Habakkuk 3:18 (NKJV)",
      "keyVerseText": "Yet I will rejoice in the LORD, I will joy in the God of my salvation."
    },
    {
      "id": "w39d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "September 29",
      "readings": "Zeph 1–3; Ps 74; 2 Cor 8",
      "summary": "God judges sin yet promises restoration and singing over His people. Psalm 74 laments destruction. Paul commends generous giving.",
      "keyVerseRef": "Zephaniah 3:17 (NKJV)",
      "keyVerseText": "He will rejoice over you with singing."
    },
    {
      "id": "w39d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "September 30",
      "readings": "Jer 1–4; Ps 130; 2 Cor 9",
      "summary": "Jeremiah receives his call to speak God’s word to a rebellious people. Psalm 130 cries from the depths for mercy. Giving flows from grace.",
      "keyVerseRef": "Jeremiah 1:5 (NKJV)",
      "keyVerseText": "Before I formed you in the womb I knew you."
    },
    {
      "id": "w39d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "October 1",
      "readings": "Jer 5–7; Ps 75; 2 Cor 10",
      "summary": "God warns against empty religion and calls for justice and repentance. Paul fights spiritual, not fleshly, battles.",
      "keyVerseRef": "Jeremiah 7:23 (NKJV)",
      "keyVerseText": "Obey My voice, and I will be your God, and you shall be My people."
    },
    {
      "id": "w39d5",
      "dayOfWeek": "Friday",
      "dateLabel": "October 2",
      "readings": "Jer 8–10; 2 Cor 11",
      "summary": "Judah rejects God’s Word and trusts idols. Paul defends gospel ministry with humility and endurance.",
      "keyVerseRef": "Jeremiah 9:23–24 (NKJV)",
      "keyVerseText": "Let not the wise man glory in his wisdom… but let him who glories glory in this, that he understands and knows Me."
    }
  ]
},
{
  "weekNumber": 40,
  "weekLabel": "Week 40 — October 5–9",
  "days": [
    {
      "id": "w40d1",
      "dayOfWeek": "Monday",
      "dateLabel": "October 5",
      "readings": "Jer 11–13; 2 Cor 12",
      "summary": "Judah refuses to listen though God pleads with His people to return. Paul boasts in weakness — God's grace is enough.",
      "keyVerseRef": "2 Corinthians 12:9 (NKJV)",
      "keyVerseText": "My grace is sufficient for you, for My strength is made perfect in weakness."
    },
    {
      "id": "w40d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "October 6",
      "readings": "Jer 14–16; Ps 76; 2 Cor 13",
      "summary": "Famine and sorrow come, yet God promises restoration and future hope. Psalm 76 praises His authority. Paul urges unity and maturity.",
      "keyVerseRef": "Jeremiah 15:16 (NKJV)",
      "keyVerseText": "Your word was to me the joy and rejoicing of my heart."
    },
    {
      "id": "w40d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "October 7",
      "readings": "Jer 17–20; Jas 1",
      "summary": "The heart is deceitful, but God renews those who trust Him. Jeremiah suffers for truth, yet God's Word is a fire. James calls for steadfast faith.",
      "keyVerseRef": "James 1:22 (NKJV)",
      "keyVerseText": "Be doers of the word, and not hearers only."
    },
    {
      "id": "w40d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "October 8",
      "readings": "Jer 22–23,26; Ps 77; Jas 2",
      "summary": "God condemns corrupt leaders and promises the Righteous Branch. Psalm 77 remembers past wonders. James calls faith to action.",
      "keyVerseRef": "Jeremiah 23:5 (NKJV)",
      "keyVerseText": "I will raise to David a Branch of righteousness; a King shall reign and prosper."
    },
    {
      "id": "w40d5",
      "dayOfWeek": "Friday",
      "dateLabel": "October 9",
      "readings": "Jer 25,35,36,45; Ps 133; Jas 3",
      "summary": "Judgment comes, yet God preserves His word and faithful servants. Psalm 133 delights in unity. James warns of the power of the tongue.",
      "keyVerseRef": "Psalm 133:1 (NKJV)",
      "keyVerseText": "Behold, how good and how pleasant it is for brethren to dwell together in unity!"
    }
  ]
},
{
  "weekNumber": 41,
  "weekLabel": "Week 41 — October 12–16",
  "days": [
    {
      "id": "w41d1",
      "dayOfWeek": "Monday",
      "dateLabel": "October 12",
      "readings": "Jer 27–29,24; Jas 4",
      "summary": "Jeremiah warns of false prophets and urges submission to God's discipline. A future hope is promised for the exiles. James warns against pride and worldliness.",
      "keyVerseRef": "Jeremiah 29:11 (NKJV)",
      "keyVerseText": "For I know the thoughts that I think toward you… to give you a future and a hope."
    },
    {
      "id": "w41d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "October 13",
      "readings": "Jer 37,21,34; Ps 79; Jas 5",
      "summary": "Jeremiah suffers for speaking truth, yet God's Word stands firm. Psalm 79 mourns destruction but pleads for mercy. James teaches patience, prayer, and confession.",
      "keyVerseRef": "James 5:16 (NKJV)",
      "keyVerseText": "The effective, fervent prayer of a righteous man avails much."
    },
    {
      "id": "w41d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "October 14",
      "readings": "Jer 30–33; 1 Pet 1",
      "summary": "God promises restoration, a new covenant, and everlasting hope. Peter calls believers to holiness through the resurrection of Christ.",
      "keyVerseRef": "Jeremiah 31:33 (NKJV)",
      "keyVerseText": "I will put My law in their minds, and write it on their hearts."
    },
    {
      "id": "w41d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "October 15",
      "readings": "Jer 38–39,52; 1 Pet 2",
      "summary": "Despite persecution, Jeremiah remains faithful. Jerusalem falls, but God preserves His servant. Peter calls believers living stones built upon Christ.",
      "keyVerseRef": "1 Peter 2:9 (NKJV)",
      "keyVerseText": "You are a chosen generation, a royal priesthood, a holy nation."
    },
    {
      "id": "w41d5",
      "dayOfWeek": "Friday",
      "dateLabel": "October 16",
      "readings": "2 Kgs 24–25; 2 Chr 36; Ps 126; 1 Pet 3",
      "summary": "Judah is taken into exile as judgment falls, yet hope remains. Psalm 126 celebrates future restoration. Peter teaches gentle strength and blessing others.",
      "keyVerseRef": "Psalm 126:3 (NKJV)",
      "keyVerseText": "The LORD has done great things for us, and we are glad."
    }
  ]
},
{
  "weekNumber": 42,
  "weekLabel": "Week 42 — October 19–23",
  "days": [
    {
      "id": "w42d1",
      "dayOfWeek": "Monday",
      "dateLabel": "October 19",
      "readings": "Lam 1–5; Ps 137; 1 Pet 4",
      "summary": "Jeremiah mourns Jerusalem's fall yet affirms God's faithfulness. Psalm 137 remembers exile. Peter calls believers to suffer with Christ.",
      "keyVerseRef": "Lamentations 3:22–23 (NKJV)",
      "keyVerseText": "Through the LORD’s mercies we are not consumed… Great is Your faithfulness."
    },
    {
      "id": "w42d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "October 20",
      "readings": "Obad; Jer 40–42; Ps 147; 1 Pet 5",
      "summary": "Edom is judged for pride and violence. God warns the remnant to trust Him, not Egypt. Peter instructs elders and urges humility and vigilance.",
      "keyVerseRef": "1 Peter 5:7 (NKJV)",
      "keyVerseText": "Casting all your care upon Him, for He cares for you."
    },
    {
      "id": "w42d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "October 21",
      "readings": "Jer 43–44,46; 2 Pet 1",
      "summary": "Judah rejects God’s warning and flees to Egypt. Yet God promises future salvation. Peter calls believers to grow in grace and knowledge.",
      "keyVerseRef": "2 Peter 1:3 (NKJV)",
      "keyVerseText": "His divine power has given to us all things that pertain to life and godliness."
    },
    {
      "id": "w42d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "October 22",
      "readings": "Jer 47–49; Ps 80; 2 Pet 2",
      "summary": "Judgment comes to the nations, yet God's compassion remains. Psalm 80 pleads for restoration. Peter warns against false teachers.",
      "keyVerseRef": "Psalm 80:3 (NKJV)",
      "keyVerseText": "Restore us, O God; cause Your face to shine, and we shall be saved!"
    },
    {
      "id": "w42d5",
      "dayOfWeek": "Friday",
      "dateLabel": "October 23",
      "readings": "Jer 50–51; 2 Pet 3",
      "summary": "Babylon falls under God’s judgment. Peter points to Christ’s return and calls believers to holy living and steadfast hope.",
      "keyVerseRef": "2 Peter 3:9 (NKJV)",
      "keyVerseText": "The Lord is not slack concerning His promise… but is longsuffering toward us."
    }
  ]
},
{
  "weekNumber": 43,
  "weekLabel": "Week 43 — October 26–30",
  "days": [
    {
      "id": "w43d1",
      "dayOfWeek": "Monday",
      "dateLabel": "October 26",
      "readings": "Ezek 1–3; John 1",
      "summary": "Ezekiel sees God’s glory and receives his prophetic calling. John proclaims Jesus as the eternal Word made flesh.",
      "keyVerseRef": "John 1:14 (NKJV)",
      "keyVerseText": "And the Word became flesh and dwelt among us."
    },
    {
      "id": "w43d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "October 27",
      "readings": "Ezek 4–6; Ps 82; John 2",
      "summary": "Symbolic judgments warn of coming destruction. Psalm 82 calls leaders to justice. Jesus reveals His glory by turning water into wine.",
      "keyVerseRef": "John 2:11 (NKJV)",
      "keyVerseText": "This beginning of signs Jesus did… and His disciples believed in Him."
    },
    {
      "id": "w43d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "October 28",
      "readings": "Ezek 7–9; John 3",
      "summary": "Judgment falls for persistent sin. God marks those who grieve over evil. Jesus teaches new birth through the Spirit.",
      "keyVerseRef": "John 3:16 (NKJV)",
      "keyVerseText": "For God so loved the world that He gave His only begotten Son."
    },
    {
      "id": "w43d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "October 29",
      "readings": "Ezek 10–12; Ps 83; John 4",
      "summary": "God’s glory departs the temple but promises restoration. Jesus offers living water — salvation for all who believe.",
      "keyVerseRef": "John 4:14 (NKJV)",
      "keyVerseText": "The water that I shall give… will become in him a fountain springing up into everlasting life."
    },
    {
      "id": "w43d5",
      "dayOfWeek": "Friday",
      "dateLabel": "October 30",
      "readings": "Ezek 13–15; Ps 136; John 5",
      "summary": "False prophets are exposed. God judges fruitless vines. Jesus heals and declares His authority as the Son of God.",
      "keyVerseRef": "John 5:24 (NKJV)",
      "keyVerseText": "He who hears My word and believes… has everlasting life."
    }
  ]
},
{
  "weekNumber": 44,
  "weekLabel": "Week 44 — November 2–6",
  "days": [
    {
      "id": "w44d1",
      "dayOfWeek": "Monday",
      "dateLabel": "November 2",
      "readings": "Ezek 16–18; John 6",
      "summary": "God exposes sin yet offers forgiveness through repentance. Jesus is the Bread of Life, calling all to believe and live.",
      "keyVerseRef": "John 6:35 (NKJV)",
      "keyVerseText": "I am the bread of life. He who comes to Me shall never hunger."
    },
    {
      "id": "w44d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "November 3",
      "readings": "Ezek 19–21; Ps 84; John 7",
      "summary": "Judgment is certain, yet God remains just and merciful. Psalm 84 delights in God’s presence. Jesus offers living water at the feast.",
      "keyVerseRef": "John 7:38 (NKJV)",
      "keyVerseText": "He who believes in Me… out of his heart will flow rivers of living water."
    },
    {
      "id": "w44d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "November 4",
      "readings": "Ezek 22–24; Ps 134; John 8",
      "summary": "God judges corruption but calls for repentance. Jesus declares Himself the Light of the World and the truth that sets people free.",
      "keyVerseRef": "John 8:12 (NKJV)",
      "keyVerseText": "I am the light of the world. He who follows Me shall not walk in darkness."
    },
    {
      "id": "w44d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "November 5",
      "readings": "Ezek 25–27; Ps 85; John 9",
      "summary": "Judgment falls on surrounding nations. God restores His people with mercy. Jesus heals a blind man — spiritual sight comes through faith.",
      "keyVerseRef": "John 9:25 (NKJV)",
      "keyVerseText": "One thing I know: that though I was blind, now I see."
    },
    {
      "id": "w44d5",
      "dayOfWeek": "Friday",
      "dateLabel": "November 6",
      "readings": "Ezek 28–30; John 10",
      "summary": "Earthly powers fall before the Lord. Jesus is the Good Shepherd who lays down His life for His sheep.",
      "keyVerseRef": "John 10:11 (NKJV)",
      "keyVerseText": "I am the good shepherd. The good shepherd gives His life for the sheep."
    }
  ]
},
{
  "weekNumber": 45,
  "weekLabel": "Week 45 — November 9–13",
  "days": [
    {
      "id": "w45d1",
      "dayOfWeek": "Monday",
      "dateLabel": "November 9",
      "readings": "Ezek 31–33; John 11",
      "summary": "Nations fall like great trees before God, but He seeks the lost as a shepherd. Jesus raises Lazarus, revealing His power over death.",
      "keyVerseRef": "John 11:25 (NKJV)",
      "keyVerseText": "I am the resurrection and the life. He who believes in Me, though he may die, he shall live."
    },
    {
      "id": "w45d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "November 10",
      "readings": "Ezek 34–36; Ps 86; John 12",
      "summary": "God Himself becomes the Shepherd of His people, promising renewal and a heart of flesh. Jesus enters Jerusalem as King.",
      "keyVerseRef": "Ezekiel 36:26 (NKJV)",
      "keyVerseText": "I will give you a new heart and put a new spirit within you."
    },
    {
      "id": "w45d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "November 11",
      "readings": "Ezek 37–39; Ps 87; John 13",
      "summary": "God breathes life into dry bones and restores His people. Jesus washes His disciples’ feet — leadership through humility and love.",
      "keyVerseRef": "John 13:34 (NKJV)",
      "keyVerseText": "A new commandment I give to you, that you love one another."
    },
    {
      "id": "w45d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "November 12",
      "readings": "Ezek 40–42; John 14",
      "summary": "Ezekiel sees the future temple — God dwelling with His people. Jesus comforts His followers: He prepares a place for them.",
      "keyVerseRef": "John 14:6 (NKJV)",
      "keyVerseText": "I am the way, the truth, and the life."
    },
    {
      "id": "w45d5",
      "dayOfWeek": "Friday",
      "dateLabel": "November 13",
      "readings": "Ezek 43–45; Ps 135; John 15",
      "summary": "The glory of God returns. Worship is restored. Jesus calls us to abide in Him — true life and fruit come from the Vine.",
      "keyVerseRef": "John 15:5 (NKJV)",
      "keyVerseText": "Without Me you can do nothing."
    }
  ]
},
{
  "weekNumber": 46,
  "weekLabel": "Week 46 — November 16–20",
  "days": [
    {
      "id": "w46d1",
      "dayOfWeek": "Monday",
      "dateLabel": "November 16",
      "readings": "Ezek 46–48; John 16",
      "summary": "Living water flows from God’s presence, healing and renewing. Jesus promises the Spirit and overcomes the world.",
      "keyVerseRef": "John 16:33 (NKJV)",
      "keyVerseText": "In the world you will have tribulation; but be of good cheer, I have overcome the world."
    },
    {
      "id": "w46d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "November 17",
      "readings": "Dan 1–3; Ps 88; John 17",
      "summary": "Daniel stands faithful in holiness. God delivers from the fire. Jesus prays for believers — unity and sanctification in truth.",
      "keyVerseRef": "John 17:17 (NKJV)",
      "keyVerseText": "Sanctify them by Your truth. Your word is truth."
    },
    {
      "id": "w46d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "November 18",
      "readings": "Dan 4–6; John 18",
      "summary": "God humbles the proud and protects His faithful. Daniel thrives in exile. Jesus is betrayed and arrested for our redemption.",
      "keyVerseRef": "Daniel 6:27 (NKJV)",
      "keyVerseText": "He delivers and rescues, and He works signs and wonders."
    },
    {
      "id": "w46d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "November 19",
      "readings": "Dan 7–9; Ps 91; John 19",
      "summary": "Visions reveal Christ's eternal kingdom. Daniel intercedes for the people. Jesus bears our sins on the cross — victory through sacrifice.",
      "keyVerseRef": "John 19:30 (NKJV)",
      "keyVerseText": "It is finished!"
    },
    {
      "id": "w46d5",
      "dayOfWeek": "Friday",
      "dateLabel": "November 20",
      "readings": "Dan 10–12; John 20",
      "summary": "Daniel sees the end — hope for the faithful. Jesus rises in power and breathes peace and mission into His disciples.",
      "keyVerseRef": "John 20:29 (NKJV)",
      "keyVerseText": "Blessed are those who have not seen and yet have believed."
    }
  ]
},
{
  "weekNumber": 47,
  "weekLabel": "Week 47 — November 23–27",
  "days": [
    {
      "id": "w47d1",
      "dayOfWeek": "Monday",
      "dateLabel": "November 23",
      "readings": "Ezra 1–2; John 21",
      "summary": "Exiles return home to rebuild and restore worship. Jesus restores Peter and commissions His followers.",
      "keyVerseRef": "John 21:17 (NKJV)",
      "keyVerseText": "Jesus said to him… “Feed My sheep.”"
    },
    {
      "id": "w47d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "November 24",
      "readings": "Ezra 3–4; Ps 92; 1 John 1",
      "summary": "Opposition arises but worship continues. Psalm 92 celebrates God’s faithfulness. Fellowship with God comes through walking in the light.",
      "keyVerseRef": "1 John 1:7 (NKJV)",
      "keyVerseText": "If we walk in the light… we have fellowship with one another."
    },
    {
      "id": "w47d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "November 25",
      "readings": "Hag; Zech 1; Ps 138; 1 John 2",
      "summary": "Haggai calls Israel to rebuild God’s house. Zechariah sees visions of restoration. Love obeys God’s Word and rejects darkness.",
      "keyVerseRef": "Haggai 1:8 (NKJV)",
      "keyVerseText": "Build the temple, that I may take pleasure in it and be glorified."
    },
    {
      "id": "w47d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "November 26",
      "readings": "Zech 2–5; Ps 93; 1 John 3",
      "summary": "God dwells among His people again. Zechariah sees cleansing through God's Spirit. God's children walk in love and righteousness.",
      "keyVerseRef": "1 John 3:1 (NKJV)",
      "keyVerseText": "Behold what manner of love the Father has bestowed on us."
    },
    {
      "id": "w47d5",
      "dayOfWeek": "Friday",
      "dateLabel": "November 27",
      "readings": "Zech 6–8; 1 John 4",
      "summary": "God restores Jerusalem in truth and peace. Perfect love casts out fear — God loved us first.",
      "keyVerseRef": "1 John 4:19 (NKJV)",
      "keyVerseText": "We love Him because He first loved us."
    }
  ]
},
{
  "weekNumber": 48,
  "weekLabel": "Week 48 — November 30–December 4",
  "days": [
    {
      "id": "w48d1",
      "dayOfWeek": "Monday",
      "dateLabel": "November 30",
      "readings": "Zech 9–11; 1 John 5",
      "summary": "Prophecy points to the humble King riding on a donkey. Faith in Jesus overcomes the world.",
      "keyVerseRef": "Zechariah 9:9 (NKJV)",
      "keyVerseText": "Behold, your King is coming to you… lowly and riding on a donkey."
    },
    {
      "id": "w48d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "December 1",
      "readings": "Zech 12–14; Ps 94; 2 John",
      "summary": "God pours out the Spirit of grace and supplication. The Lord will be King over all the earth. Walk in truth and love.",
      "keyVerseRef": "Zechariah 14:9 (NKJV)",
      "keyVerseText": "The LORD shall be King over all the earth."
    },
    {
      "id": "w48d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "December 2",
      "readings": "Ezra 5–6; Ps 95; 3 John",
      "summary": "Temple construction resumes by God's decree. Psalm 95 calls for worship and obedience. Walk in truth and hospitality.",
      "keyVerseRef": "Psalm 95:6 (NKJV)",
      "keyVerseText": "Oh come, let us worship and bow down."
    },
    {
      "id": "w48d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "December 3",
      "readings": "Esth 1–3; Ps 139; Rev 1",
      "summary": "Esther enters the stage of redemption. Psalm 139 celebrates God's intimate knowledge. Jesus appears in glory to John.",
      "keyVerseRef": "Revelation 1:8 (NKJV)",
      "keyVerseText": "I am the Alpha and the Omega… the Almighty."
    },
    {
      "id": "w48d5",
      "dayOfWeek": "Friday",
      "dateLabel": "December 4",
      "readings": "Esth 4–6; Rev 2",
      "summary": "Esther risks her life for God's people. Jesus speaks to the churches — calling for love, faithfulness, and repentance.",
      "keyVerseRef": "Esther 4:14 (NKJV)",
      "keyVerseText": "Yet who knows whether you have come to the kingdom for such a time as this?"
    }
  ]
},
{
  "weekNumber": 49,
  "weekLabel": "Week 49 — December 7–11",
  "days": [
    {
      "id": "w49d1",
      "dayOfWeek": "Monday",
      "dateLabel": "December 7",
      "readings": "Esth 7–10; Rev 3",
      "summary": "God rescues His people through Esther’s bold obedience. Jesus calls the church to awaken, overcome, and hold fast.",
      "keyVerseRef": "Esther 9:22 (NKJV)",
      "keyVerseText": "The Jews had light and gladness, joy and honor."
    },
    {
      "id": "w49d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "December 8",
      "readings": "Ezra 7–10; Ps 97; Rev 4",
      "summary": "Ezra leads a return to Scripture and repentance. Psalm 97 exalts God's reign. John sees heaven’s throne and unending worship.",
      "keyVerseRef": "Revelation 4:11 (NKJV)",
      "keyVerseText": "You are worthy, O Lord, to receive glory and honor and power."
    },
    {
      "id": "w49d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "December 9",
      "readings": "Neh 1–3; Rev 5",
      "summary": "Nehemiah seeks God’s favor and begins rebuilding the wall. Heaven worships the Lamb who alone is worthy.",
      "keyVerseRef": "Nehemiah 2:20 (NKJV)",
      "keyVerseText": "The God of heaven Himself will prosper us."
    },
    {
      "id": "w49d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "December 10",
      "readings": "Neh 4–6; Ps 98; Rev 6",
      "summary": "Despite opposition, the work continues by faith and vigilance. Psalm 98 shouts joy to the King who judges in righteousness.",
      "keyVerseRef": "Nehemiah 6:9 (NKJV)",
      "keyVerseText": "Now therefore, O God, strengthen my hands."
    },
    {
      "id": "w49d5",
      "dayOfWeek": "Friday",
      "dateLabel": "December 11",
      "readings": "Neh 7–9; Ps 140; Rev 7",
      "summary": "The people confess sin, renew covenant, and rejoice in God’s mercy. A great multitude worships before the throne.",
      "keyVerseRef": "Nehemiah 8:10 (NKJV)",
      "keyVerseText": "The joy of the LORD is your strength."
    }
  ]
},
{
  "weekNumber": 50,
  "weekLabel": "Week 50 — December 14–18",
  "days": [
    {
      "id": "w50d1",
      "dayOfWeek": "Monday",
      "dateLabel": "December 14",
      "readings": "Neh 10–13; Rev 8",
      "summary": "The covenant is renewed with commitment to holiness. Worship and Sabbath are restored. Revelation reveals prayers rising like incense.",
      "keyVerseRef": "Nehemiah 13:14 (NKJV)",
      "keyVerseText": "Remember me, O my God, concerning this."
    },
    {
      "id": "w50d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "December 15",
      "readings": "Mal; Ps 2; Rev 9",
      "summary": "God rebukes empty religion and promises the Sun of Righteousness. Psalm 2 exalts the King. Judgment falls, but mercy awaits repentance.",
      "keyVerseRef": "Malachi 4:2 (NKJV)",
      "keyVerseText": "The Sun of Righteousness shall arise with healing in His wings."
    },
    {
      "id": "w50d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "December 16",
      "readings": "Job 1–3; Ps 29; Rev 10",
      "summary": "Righteous Job suffers without explanation. God remains sovereign. The mighty angel announces there will be no more delay.",
      "keyVerseRef": "Job 1:21 (NKJV)",
      "keyVerseText": "The LORD gave, and the LORD has taken away; blessed be the name of the LORD."
    },
    {
      "id": "w50d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "December 17",
      "readings": "Job 4–7; Ps 99; Rev 11",
      "summary": "Job laments his pain and questions life's purpose, yet clings to God. The witnesses testify and the kingdom is proclaimed.",
      "keyVerseRef": "Job 5:8 (NKJV)",
      "keyVerseText": "As for me, I would seek God."
    },
    {
      "id": "w50d5",
      "dayOfWeek": "Friday",
      "dateLabel": "December 18",
      "readings": "Job 8–11; Rev 12",
      "summary": "Friends debate Job’s suffering, but only God knows the truth. War breaks out in heaven—Christ triumphs.",
      "keyVerseRef": "Revelation 12:11 (NKJV)",
      "keyVerseText": "And they overcame him by the blood of the Lamb."
    }
  ]
},
{
  "weekNumber": 51,
  "weekLabel": "Week 51 — December 21–25",
  "days": [
    {
      "id": "w51d1",
      "dayOfWeek": "Monday",
      "dateLabel": "December 21",
      "readings": "Job 12–14; Ps 100; Rev 13",
      "summary": "Job wrestles with suffering yet acknowledges God’s wisdom. Psalm 100 calls all creation to joyful praise. Revelation reveals a coming struggle of faith.",
      "keyVerseRef": "Psalm 100:5 (NKJV)",
      "keyVerseText": "For the LORD is good; His mercy is everlasting."
    },
    {
      "id": "w51d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "December 22",
      "readings": "Job 15–17; Rev 14",
      "summary": "Job endures accusations but hopes in heavenly witness. Angels proclaim eternal gospel and judgment with mercy for the redeemed.",
      "keyVerseRef": "Job 19:25 (NKJV)",
      "keyVerseText": "For I know that my Redeemer lives."
    },
    {
      "id": "w51d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "December 23",
      "readings": "Job 18–20; Ps 141; Rev 15",
      "summary": "Debate continues as Job cries for vindication. Psalm 141 seeks purity of speech. Heaven sings of God’s righteous judgments.",
      "keyVerseRef": "Job 23:10 (NKJV)",
      "keyVerseText": "He knows the way that I take; when He has tested me, I shall come forth as gold."
    },
    {
      "id": "w51d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "December 24",
      "readings": "Job 21–23; Ps 101; Rev 16",
      "summary": "Job questions the prosperity of the wicked but clings to God. Psalm 101 commits to holy living. Wrath falls, yet grace remains.",
      "keyVerseRef": "Psalm 101:2 (NKJV)",
      "keyVerseText": "I will behave wisely in a perfect way."
    },
    {
      "id": "w51d5",
      "dayOfWeek": "Friday",
      "dateLabel": "December 25",
      "readings": "Job 24–27; Rev 17",
      "summary": "Job wrestles with justice and mystery. Earthly power collapses before the Lamb. Christmas hope shines even in suffering.",
      "keyVerseRef": "Isaiah 9:6 (NKJV)",
      "keyVerseText": "For unto us a Child is born… and His name will be called Wonderful."
    }
  ]
},
{
  "weekNumber": 52,
  "weekLabel": "Week 52 — December 28–31",
  "days": [
    {
      "id": "w52d1",
      "dayOfWeek": "Monday",
      "dateLabel": "December 28",
      "readings": "Job 28–30; Rev 18",
      "summary": "Wisdom belongs to God alone. Earthly kingdoms fall before His glory. Only treasure in Christ endures forever.",
      "keyVerseRef": "Job 28:28 (NKJV)",
      "keyVerseText": "Behold, the fear of the Lord, that is wisdom."
    },
    {
      "id": "w52d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "December 29",
      "readings": "Job 31–33; Ps 102; Rev 19",
      "summary": "Job makes his final defense. Elihu points to God’s greatness. Heaven rejoices — Christ reigns as King of kings.",
      "keyVerseRef": "Revelation 19:16 (NKJV)",
      "keyVerseText": "KING OF KINGS AND LORD OF LORDS."
    },
    {
      "id": "w52d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "December 30",
      "readings": "Job 34–36; Rev 20",
      "summary": "God is just in all His ways. The final judgment is revealed. Satan falls — Christ reigns forever.",
      "keyVerseRef": "Revelation 20:12 (NKJV)",
      "keyVerseText": "The dead were judged according to their works."
    },
    {
      "id": "w52d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "December 31",
      "readings": "Job 37–39; Ps 103; Rev 21",
      "summary": "God speaks from the whirlwind — He alone rules creation. A new heaven and new earth are promised.",
      "keyVerseRef": "Revelation 21:4 (NKJV)",
      "keyVerseText": "There shall be no more death, nor sorrow, nor crying."
    },
    {
      "id": "w52d5",
      "dayOfWeek": "Friday",
      "dateLabel": "January 1",
      "readings": "Job 40–42; Ps 150; Rev 22",
      "summary": "Job repents and is restored. Worship rises to God who reigns forever. Jesus returns — the year ends in glory and begins in hope.",
      "keyVerseRef": "Revelation 22:20 (NKJV)",
      "keyVerseText": "Surely I am coming quickly. Amen. Even so, come, Lord Jesus!"
    }
  ]
}
]

