[
  {
    "weekNumber": 1,
    "weekLabel": "Week 1 — January 5–9",
    "days": [
      {
        "id": "w1d1",
        "dayOfWeek": "Monday",
        "dateLabel": "January 5",
        "readings": "Gen 1–2; Ps 19; Mark 1",
        "summary": "God creates the heavens and the earth, crowns humans with His image, reveals His glory in creation, and Jesus begins His public ministry calling people to follow Him.",
        "keyVerseRef": "Psalm 19:1 (NKJV)",
        "keyVerseText": "The heavens declare the glory of God; and the firmament shows His handiwork."
      },
      {
        "id": "w1d2",
        "dayOfWeek": "Tuesday",
        "dateLabel": "January 6",
        "readings": "Gen 3–5; Mark 2",
        "summary": "Sin enters the world, but God promises a coming Deliverer; even as death spreads, God preserves a line of faith, and Jesus forgives, heals, and calls sinners to Himself.",
        "keyVerseRef": "Genesis 3:15 (NKJV)",
        "keyVerseText": "And I will put enmity between you and the woman, and between your seed and her Seed; He shall bruise your head, and you shall bruise His heel."
      },
      {
        "id": "w1d3",
        "dayOfWeek": "Wednesday",
        "dateLabel": "January 7",
        "readings": "Gen 6–8; Ps 104; Mark 3",
        "summary": "Human wickedness fills the earth, yet Noah finds grace; God judges through the flood and restores creation, showing His power and faithfulness, while Jesus confronts evil and calls a new family of faith.",
        "keyVerseRef": "Genesis 6:8 (NKJV)",
        "keyVerseText": "But Noah found grace in the eyes of the LORD."
      },
      {
        "id": "w1d4",
        "dayOfWeek": "Thursday",
        "dateLabel": "January 8",
        "readings": "Gen 9–11; Mark 4",
        "summary": "God makes covenant with Noah, promises never again to destroy the earth with a flood, and scatters proud humanity at Babel, while Jesus teaches in parables about the kingdom of God growing like seed.",
        "keyVerseRef": "Genesis 9:13 (NKJV)",
        "keyVerseText": "I set My rainbow in the cloud, and it shall be for the sign of the covenant between Me and the earth."
      },
      {
        "id": "w1d5",
        "dayOfWeek": "Friday",
        "dateLabel": "January 9",
        "readings": "Gen 12–15; Ps 148; Mark 5",
        "summary": "God calls Abram, makes covenant to bless all nations through his offspring, counts his faith as righteousness, and we see Jesus’ authority to free the bound, heal the sick, and raise the dead.",
        "keyVerseRef": "Genesis 12:2 (NKJV)",
        "keyVerseText": "I will make you a great nation; I will bless you and make your name great; and you shall be a blessing."
      }
    ]
  },
  {
    "weekNumber": 2,
    "weekLabel": "Week 2 — January 12–16",
    "days": [
      {
        "id": "w2d1",
        "dayOfWeek": "Monday",
        "dateLabel": "January 12",
        "readings": "Gen 16–18; Mark 6",
        "summary": "Abram and Sarai try to ‘help’ God’s promise through Hagar, yet the Lord remains faithful and reaffirms His covenant, while Jesus feeds the multitudes and walks on water, revealing God’s compassion and power.",
        "keyVerseRef": "Genesis 18:14 (NKJV)",
        "keyVerseText": "Is anything too hard for the LORD? At the appointed time I will return to you, according to the time of life, and Sarah shall have a son."
      },
      {
        "id": "w2d2",
        "dayOfWeek": "Tuesday",
        "dateLabel": "January 13",
        "readings": "Gen 19–20; Ps 1; Mark 7",
        "summary": "God judges the wickedness of Sodom yet rescues Lot, shows mercy even amid failure, and we are reminded that the blessed life delights in God’s law, while Jesus confronts empty traditions and cleanses hearts.",
        "keyVerseRef": "Psalm 1:2 (NKJV)",
        "keyVerseText": "But his delight is in the law of the LORD, and in His law he meditates day and night."
      },
      {
        "id": "w2d3",
        "dayOfWeek": "Wednesday",
        "dateLabel": "January 14",
        "readings": "Gen 21–23; Ps 107; Mark 8",
        "summary": "God keeps His promise as Isaac is born; Abraham’s faith is tested on the mountain, pointing to a greater sacrifice to come, while Jesus calls His followers to deny themselves and take up their cross.",
        "keyVerseRef": "Genesis 22:8 (NKJV)",
        "keyVerseText": "And Abraham said, “My son, God will provide for Himself the lamb for a burnt offering.” So the two of them went together."
      },
      {
        "id": "w2d4",
        "dayOfWeek": "Thursday",
        "dateLabel": "January 15",
        "readings": "Gen 24–25; Ps 4; Mark 9",
        "summary": "God providentially leads in Isaac’s marriage and the next generation, while rival nations are pictured in Jacob and Esau, and Jesus is transfigured in glory and teaches about true greatness and faith.",
        "keyVerseRef": "Genesis 24:27 (NKJV)",
        "keyVerseText": "Blessed be the LORD God of my master Abraham, who has not forsaken His mercy and His truth toward my master. As for me, being on the way, the LORD led me to the house of my master’s brethren."
      },
      {
        "id": "w2d5",
        "dayOfWeek": "Friday",
        "dateLabel": "January 16",
        "readings": "Gen 26–27; Mark 10",
        "summary": "God reaffirms His covenant to Isaac, protects him, and works even through family conflict and deceit, while Jesus teaches about humble, childlike faith and the cost of following Him above riches.",
        "keyVerseRef": "Genesis 26:24 (NKJV)",
        "keyVerseText": "And the LORD appeared to him the same night and said, “I am the God of your father Abraham; do not fear, for I am with you. I will bless you and multiply your descendants for My servant Abraham’s sake.”"
      }
    ]
  },
{
  "weekNumber": 3,
  "weekLabel": "Week 3 — January 19–23",
  "days": [
    {
      "id": "w3d1",
      "dayOfWeek": "Monday",
      "dateLabel": "January 19",
      "readings": "Gen 28–29; Mark 11",
      "summary": "Jacob encounters God at Bethel and begins his years of service with Laban, while Jesus enters Jerusalem as the promised Messiah and teaches about true faith and fruitfulness.",
      "keyVerseRef": "Genesis 28:15 (NKJV)",
      "keyVerseText": "Behold, I am with you and will keep you wherever you go, and will bring you back to this land; for I will not leave you until I have done what I have spoken to you."
    },
    {
      "id": "w3d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "January 20",
      "readings": "Gen 30–31; Ps 11; Mark 12",
      "summary": "God prospers Jacob despite tension and deceit, showing His covenant faithfulness, while Jesus teaches the greatest commandments—love God with all your heart, and love your neighbor as yourself.",
      "keyVerseRef": "Mark 12:30–31 (NKJV)",
      "keyVerseText": "‘And you shall love the LORD your God with all your heart, with all your soul, with all your mind, and with all your strength.’ This is the first commandment. And the second, like it, is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these."
    },
    {
      "id": "w3d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "January 21",
      "readings": "Gen 32–34; Ps 145; Mark 13",
      "summary": "Jacob wrestles with God and receives a new name—Israel. Reconciliation with Esau displays grace triumphing over fear, and Jesus speaks of the end times, calling His people to watch and endure.",
      "keyVerseRef": "Genesis 32:28 (NKJV)",
      "keyVerseText": "And He said, “Your name shall no longer be called Jacob, but Israel; for you have struggled with God and with men, and have prevailed.”"
    },
    {
      "id": "w3d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "January 22",
      "readings": "Gen 35–37; Ps 12; Mark 14",
      "summary": "God reaffirms His covenant with Jacob; Joseph is betrayed by his brothers yet remains central to God’s plan, while Jesus prepares for the cross—the ultimate betrayal that will bring salvation.",
      "keyVerseRef": "Genesis 35:11 (NKJV)",
      "keyVerseText": "Also God said to him: “I am God Almighty. Be fruitful and multiply; a nation and a company of nations shall proceed from you, and kings shall come from your body.”"
    },
    {
      "id": "w3d5",
      "dayOfWeek": "Friday",
      "dateLabel": "January 23",
      "readings": "Gen 38–40; Mark 15",
      "summary": "God works through broken people as Judah’s line moves toward Messiah, and Joseph rises through suffering to a place of influence—pointing to Christ, the innocent One condemned yet victorious.",
      "keyVerseRef": "Mark 15:39 (NKJV)",
      "keyVerseText": "So when the centurion, who stood opposite Him, saw that He cried out like this and breathed His last, he said, “Truly this Man was the Son of God!”"
    }
  ]
},
{
  "weekNumber": 4,
  "weekLabel": "Week 4 — January 26–30",
  "days": [
    {
      "id": "w4d1",
      "dayOfWeek": "Monday",
      "dateLabel": "January 26",
      "readings": "Gen 41–42; Mark 16",
      "summary": "Joseph interprets Pharaoh’s dreams and rises to power, saving many lives. His brothers come seeking grain, beginning a powerful story of grace and reconciliation. Christ is risen—our salvation and hope.",
      "keyVerseRef": "Mark 16:6 (NKJV)",
      "keyVerseText": "But he said to them, “Do not be alarmed. You seek Jesus of Nazareth, who was crucified. He is risen! He is not here.”"
    },
    {
      "id": "w4d2",
      "dayOfWeek": "Tuesday",
      "dateLabel": "January 27",
      "readings": "Gen 43–44; Ps 24; Gal 1",
      "summary": "Joseph tests his brothers and reveals the transformation of Judah, while Psalm 24 declares God’s glory and Paul defends the true gospel—Christ’s work alone saves.",
      "keyVerseRef": "Galatians 1:10 (NKJV)",
      "keyVerseText": "For do I now persuade men, or God? Or do I seek to please men? For if I still pleased men, I would not be a bondservant of Christ."
    },
    {
      "id": "w4d3",
      "dayOfWeek": "Wednesday",
      "dateLabel": "January 28",
      "readings": "Gen 45–46; Ps 108; Gal 2",
      "summary": "Joseph reveals himself and extends forgiveness, restoring what was broken for God’s glory. Israel moves to Egypt in faith. Paul confronts hypocrisy, affirming justification by faith alone.",
      "keyVerseRef": "Genesis 45:5 (NKJV)",
      "keyVerseText": "But now, do not therefore be grieved or angry with yourselves because you sold me here; for God sent me before you to preserve life."
    },
    {
      "id": "w4d4",
      "dayOfWeek": "Thursday",
      "dateLabel": "January 29",
      "readings": "Gen 47–48; Ps 25; Gal 3",
      "summary": "Israel blesses Joseph’s sons by faith, giving Ephraim greater honor. God’s covenant promise continues through generations. Paul teaches that righteousness comes through faith—not law.",
      "keyVerseRef": "Galatians 3:29 (NKJV)",
      "keyVerseText": "And if you are Christ’s, then you are Abraham’s seed, and heirs according to the promise."
    },
    {
      "id": "w4d5",
      "dayOfWeek": "Friday",
      "dateLabel": "January 30",
      "readings": "Gen 49–50; Gal 4",
      "summary": "Jacob blesses his sons, prophesying kingship through Judah and pointing to the Messiah. Joseph’s death points forward to deliverance yet to come. In Christ we are adopted as sons and heirs.",
      "keyVerseRef": "Galatians 4:7 (NKJV)",
      "keyVerseText": "Therefore you are no longer a slave but a son, and if a son, then an heir of God through Christ."
    }
  ]
}


